{"pageProps":{"day":"2022-07-15","schedule":{"slots":[{"time":540,"duration":15,"sessions":[{"id":"8LXW7T","title":"Morning Announcement","duration":15,"abstract":"Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement Morning Announcement","day":"2022-07-15","time":540,"endTime":555,"audience":"intermediate","rooms":["The Auditorium"],"slug":"morning-announcement","type":"opening-session","speakers":[],"start":"2022-07-15T09:00:00+01:00","end":"2022-07-15T09:15:00+01:00"}],"type":"timeslot"},{"time":555,"duration":45,"sessions":[{"id":"CEPSYS","title":"Multithreaded Python without the GIL","duration":45,"abstract":"CPython’s “Global Interpreter Lock”, or “GIL”, prevents multiple threads from executing Python code in parallel. The GIL was added to Python in 1992 together with the original support for threads in order to protect access to the interpreter’s shared state.\r\n\r\nPython supports a number of ways to enable parallelism within the constraints of the GIL, but they come with significant limitations. Imagine if you could avoid the startup time of joblib workers, the multiprocess instability of PyTorch’s DataLoaders, and the overhead of pickling data for inter-process communication.\r\n\r\nThe “nogil” project aims to remove the GIL from CPython to make multithreaded Python programs more efficient, while maintaining backward compatibility and single-threaded performance. It exists as a fork, but the eventual goal is to contribute these changes upstream.\r\n\r\nThis talk will cover the changes to Python to let it run efficiently without the GIL and what these changes mean for Python programmers and extension authors.","day":"2022-07-15","time":555,"endTime":600,"audience":"intermediate","rooms":["The Auditorium"],"slug":"multithreaded-python-without-the-gil","type":"keynote","speakers":[{"code":"DMWLH3","name":"Sam Gross","biography":"Sam Gross is a software engineer at Meta AI. He is a co-author of PyTorch, an open-source Python machine learning framework. He holds M.Eng. and B.S. degrees in computer science from the Massachusetts Institute of Technology.\r\n\r\n\r\n  Since moving to DIAS he has worked on the development of calibration and\r\n  software tools for the Mid-Infrared Instrument (MIRI) on Webb. MIRI is an\r\n  international project comprising a consortium of European partner institutes,\r\n  including DIAS, the European Space Agency, and partners in the US.\r\n\r\n\r\n  He works on many aspects of MIRI including the calibration of the MIRI Medium\r\n  Resolution Spectrometer, development of the MIRI simulator, MIRI commissioning\r\n  activities and analysis tools, and will support MIRI commissioning at the Webb\r\n  Mission Operations Center at the Space Telescope Science Institute in\r\n  Baltimore.","avatar":null,"slug":"sam-gross","affiliation":"Meta AI","homepage":null,"twitter":null}],"start":"2022-07-15T09:15:00+01:00","end":"2022-07-15T10:00:00+01:00"}],"type":"timeslot"},{"time":600,"title":"Coffee Break","duration":30,"type":"break"},{"time":630,"duration":45,"sessions":[{"id":"8JDRVD","title":"Writing secure code in Python","duration":45,"abstract":"The talk will analyze a series of vulnerabilities that given some common mistakes might end up damaging your Python programs (with lots of exemples!). At the end, a precaution and audit method will be presented.","day":"2022-07-15","time":630,"endTime":675,"audience":"intermediate","rooms":["Liffey B"],"slug":"writing-secure-code-in-python","type":"talk","speakers":[{"code":"SA3X9R","name":"Yan Orestes","biography":"Yan is a Brazilian Python developer, speaker, privacy freak and security enthusiast. He's worked as a teacher and takes education as a true passion in his life. Whenever he finds time, Yan ends up writing blog posts and essays and talking in conferences everywhere, following what he believes is most important in the world - sharing knowledge.","avatar":"https://program.europython.eu/media/avatars/me_8cDiqA7.jpeg","slug":"yan-orestes","affiliation":"Lean Tech","homepage":"https://esquer.dev","twitter":"@yyyyyyyan_"}],"start":"2022-07-15T10:30:00+01:00","end":"2022-07-15T11:00:00+01:00"},{"id":"9QM8ZM","title":"What transitioning from male to female taught me about leadership","duration":45,"abstract":"Not many leaders transition in their mid thirties but I did and it gave me a unique perspective on courage, humility, diversity and inclusion in the context of leadership. In this talk I will tell the story of my transition and along the way you will learn how you can become a better leader.","day":"2022-07-15","time":630,"endTime":675,"audience":"beginner","rooms":["Wicklow Hall 1"],"slug":"what-transitioning-from-male-to-female-taught-me-about-leadership","type":"talk","speakers":[{"code":"9SYDFX","name":"Ivett Ördög","biography":"Ivett Ördög is the founder and facilitator of Lean Poker events. She is also an Engineering Manager at Contentful, and she has been a frequent speaker at software conferences around Europe. Her passion for short feedback loops drove her to create Lean Poker, a workshop where developers have the opportunity to experiment with continuous delivery in a safe environment. Ivett is the creator and host of the Cup of Code YouTube channel inspiring the next generation of developers to broaden their knowledge.","avatar":"https://program.europython.eu/media/avatars/DSC_2275_VN94PyO.jpg","slug":"ivett-ordog","affiliation":"Lean Poker","homepage":"http://leanpoker.org","twitter":"@ivettordog"}],"start":"2022-07-15T10:30:00+01:00","end":"2022-07-15T11:15:00+01:00"},{"id":"CPNE9S","title":"AI for Content Moderation at PayPal","duration":45,"abstract":"Online platforms have a hard time combating hate, hate speech, explicit content and other NSFW material. Most of the solutions are rule based keyword approaches which are brittle and can be bypassed easily. At PayPal, we have a wide range of user generated content and there is a great need to automatically identify and flag hate, explicit and other typologies, to improve user experience and adhere to regulatory policies. In this talk we showcase how AI can help us identify such content with great precision.","day":"2022-07-15","time":630,"endTime":675,"audience":"intermediate","rooms":["Liffey Hall 1"],"slug":"ai-for-content-moderation-at-paypal","type":"talk","speakers":[{"code":"J98AEX","name":"Raghotham Sripadraj","biography":"Raghotham is an AI Architect at PayPal and leads AI teams for the Customer Success Platform. He comes with rich background in building AI platforms and teams for startups and large enterprises. Drawing on his deep love for data science and neural networks and his passion for teaching, Raghotham has conducted workshops across the world and given talks at a number of data science conferences. Apart from getting his hands dirty with data, he loves traveling, Pink Floyd, and masala dosas.","avatar":"https://program.europython.eu/media/avatars/2022-04-03_22.40.18_BPxR1BI.jpg","slug":"raghotham-sripadraj","affiliation":"PayPal Inc","homepage":"https://raghothams.in","twitter":"@raghothams"},{"code":"XENQTK","name":"Ryan Roggenkemper","biography":"Ryan is an NLP Engineer at PayPal, primarily working on text content moderation for the Customer Success Platform. He is fairly new to the field of NLP, with just over 1 year of experience, but has a great passion for all things statistics and data science. This is his first conference appearance (but hopefully not his last!), and he is very excited to present and learn! He's also very enthusiastic about ice cream. Probably too enthusiastic...","avatar":null,"slug":"ryan-roggenkemper","affiliation":"PayPal","homepage":null,"twitter":null}],"start":"2022-07-15T10:30:00+01:00","end":"2022-07-15T11:15:00+01:00"},{"id":"FZQGFP","title":"How to embed a Python interpreter in an iOS app","duration":45,"abstract":"Come see how you can make a native mobile app that embeds Python 3.10 to allow users to script app behavior. It's allowed by Apple but is currently underutilized by the app makers. Add superpowers to your iPhone app with Python!\r\n\r\nNative mobile applications have many advantages over mobile websites or apps made with cross-platform toolkits. They will use less battery, allow for richer graphics, more consistent UI behavior, and enable more functionality through device-specific APIs. Wouldn't it be great to have access to all this from Python?\r\n\r\nIn this talk, we'll marry a native iOS app written in Swift with an embedded Python 3.10 interpreter to allow users to customize what the application is doing. We'll go through the entire process of:\r\n\r\n- embedding Python from source;\r\n- building it into the Swift mobile app in Xcode;\r\n- adding a few pre-compiled third-party libraries like numpy and Pillow to broaden the scope of what the user can do;\r\n- running the resulting app on an iPhone 13;\r\n- modifying the app behavior at runtime thanks to our new Python superpowers!\r\n\r\nKnowledge of Swift is not required for attendees of this talk. However, it will be needed later if you're willing to embed Python in an iPhone app. Embedding Python doesn't really let you make an app without knowing Swift. Don't fret though! It's pretty easy to get a hang of Swift when you're fluent in Python.","day":"2022-07-15","time":630,"endTime":675,"audience":"advanced","rooms":["Liffey A"],"slug":"how-to-embed-a-python-interpreter-in-an-ios-app","type":"talk","speakers":[{"code":"YFCVFV","name":"Łukasz Langa","biography":"CPython Developer in Residence, Python 3.8 and 3.9 release manager, creator of Black, pianist, dad.\r\n\r\nEqually interested in music and software engineering, as a classically-trained pianist and a long-time contributor to the Python programming language. Loves to build software for musical instruments. Makes music under the [RPLKTR](https://rplktr.com/) moniker.","avatar":"https://program.europython.eu/media/avatars/%C5%81ukasz_Langa_Portret_2021.10_Prawy_profil_VNI4Aj1.jpeg","slug":"lukasz-langa","affiliation":"Python Software Foundation","homepage":"https://lukasz.langa.pl/","twitter":"@llanga"}],"start":"2022-07-15T10:30:00+01:00","end":"2022-07-15T11:15:00+01:00"},{"id":"USWAD9","title":"`typing.Protocol`: type hints as Guido intended","duration":45,"abstract":"If your type-hinted Python code is Java flavored, you're probably underusing `typing.Protocol`. Python is literally built on structural typing, a.k.a. duck typing. It's how `__special__` methods work. Type hints were introduced in Python 3.5 without support for duck typing, but it was added in Python 3.8 and we should all be using `typing.Protocol` to have our code statically checked **and** Pythonic.","day":"2022-07-15","time":630,"endTime":675,"audience":"intermediate","rooms":["The Auditorium"],"slug":"typing-protocol-type-hints-as-guido-intended","type":"talk","speakers":[{"code":"AX8V78","name":"Luciano Ramalho","biography":"Luciano Ramalho is the author of Fluent Python, published in 9 languages. He is a Principal Consultant at Thoughtworks and a Fellow of the Python Software Foundation.","avatar":"https://program.europython.eu/media/avatars/LucianoRamalho2016-500x.jpg","slug":"luciano-ramalho","affiliation":"Thoughtworks","homepage":"https://www.thoughtworks.com/en-br/profiles/l/luciano-ramalho","twitter":"@ramalhoorg"}],"start":"2022-07-15T10:30:00+01:00","end":"2022-07-15T11:15:00+01:00"},{"id":"YMAR7H","title":"Jupyter - Under the Hood","duration":45,"abstract":"Jupyter Notebooks at their core are just JSON documents that contain all your code, markdown styles and outputs. Yet when you run a notebook, there's a lot that's happening under the hood - from starting a session with the notebook server, to launching an IPython kernel, and a rich Web UI communicating with the notebook server and the IPython kernel using Jupyter's REST APIs and ZMQ websockets. We will explore the Jupyter ecosystem (Jupyter, JupyterLab, JupyterHub) and see how this system comes together.","day":"2022-07-15","time":630,"endTime":675,"audience":"intermediate","rooms":["Liffey Hall 2"],"slug":"jupyter-under-the-hood","type":"talk","speakers":[{"code":"7VMLGN","name":"Dhanshree Arora","biography":"Hi I am Dhanshree, \r\nI have been developing with Python for over 3 years now. I enjoy working with computers. I work with machine learning, backend development, cloud and infrastructure.","avatar":"https://program.europython.eu/media/avatars/image_QQzHuxX.png","slug":"dhanshree-arora","affiliation":"ML Consultant","homepage":null,"twitter":"@dhanshree_arora"}],"start":"2022-07-15T10:30:00+01:00","end":"2022-07-15T11:15:00+01:00"}],"type":"timeslot"},{"time":680,"duration":30,"sessions":[{"id":"87XUMG","title":"Why is it slow? Strategies for solving performance problems","duration":30,"abstract":"You have a performance problem, and you don't know what to do. All you know is that one of your endpoints is very slow; and perhaps it only affects a certain user. How do you figure out why it's slow, and what can you do to catch performance problems before they hurt users in production? This talk will step through several scenarios involving typical performance problems and how to diagnose them.","day":"2022-07-15","time":680,"endTime":710,"audience":"intermediate","rooms":["Liffey A"],"slug":"why-is-it-slow-strategies-for-solving-performance-problems","type":"talk","speakers":[{"code":"9JJFPM","name":"Caleb Hattingh","biography":"TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD TBD","avatar":"https://program.europython.eu/media/avatars/sqfortekmojitwitch_VVdyZFb.jpg","slug":"caleb-hattingh","affiliation":"Kapiche Pty Ltd","homepage":"tekmoji.com","twitter":null}],"start":"2022-07-15T11:20:00+01:00","end":"2022-07-15T11:50:00+01:00"},{"id":"CJNVSR","title":"Mercury - Build & Share Data Apps from Jupyter Notebook","duration":30,"abstract":"Have you ever wished to magically transform your notebook into a web app and share it with non-coders? The [Mercury](https://github.com/mljar/mercury) is a new open-source framework for converting Jupyter Notebook to a web app.","day":"2022-07-15","time":680,"endTime":710,"audience":"intermediate","rooms":["Liffey Hall 2"],"slug":"mercury-build-share-data-apps-from-jupyter-notebook","type":"talk","speakers":[{"code":"JWK7RV","name":"Piotr Płoński","biography":"Software engineer with a passion for creating Data Science tools. Working on Mercury (framework for converting notebooks to web apps) and MLJAR AutoML (Automatic Machine Learning for Tabular Data).","avatar":"https://program.europython.eu/media/avatars/pplonski_smile_Mz6QCW4.jpeg","slug":"piotr-plonski","affiliation":"MLJAR Sp. z o.o.","homepage":"https://mljar.com","twitter":"MLJARofficial"}],"start":"2022-07-15T11:20:00+01:00","end":"2022-07-15T11:50:00+01:00"},{"id":"GRG9SC","title":"Tales of Python Security","duration":30,"abstract":"Security vulnerabilities receive huge publicity but also significant secrecy. In this session, we will walk through some of the biggest issues of the last few years from the perspective of a member of the Python Security Response Team. You'll learn how we work to protect all CPython users, how you can help, and how you can help protect yourself from malicious attackers.","day":"2022-07-15","time":680,"endTime":710,"audience":"beginner","rooms":["Liffey B"],"slug":"tales-of-python-security","type":"talk","speakers":[{"code":"PMWVSA","name":"Steve Dower","biography":"Steve is an engineer who tells people about Python and then gives them excuses to use it and great tools to use it with. He is a core developer and Windows expert for CPython, a member of the Python Security Response Team, and works at Microsoft as a roaming Python expert, making sure Python users are well supported across all their platforms.","avatar":"https://program.europython.eu/media/avatars/Headshot_Python_2q9HWBk.jpg","slug":"steve-dower","affiliation":"Microsoft","homepage":"https://stevedower.id.au","twitter":"zooba"}],"start":"2022-07-15T11:20:00+01:00","end":"2022-07-15T11:50:00+01:00"},{"id":"S78FW7","title":"When Models Query Models","duration":30,"abstract":"The design of large-scale engineering systems, including but not limited to aerospace, particle accelerators, nuclear power plants, is carried out by a wide range of numerical models such as CAD files, finite-element models, and machine learning surrogate models to name a few.  In order to provide a uniform modelling interface, we encapsulate numerical models in notebooks. A notebook is controlling model creation, execution, and query of results. Numerical solvers are embedded into Docker containers and provide an isolated and reproducible environment exposing a language-agnostic REST API. A model registry enables efficient queries of models. The overall system is represented as a collection of models that exchange data. Then, the design optimization involves execution of a dependency tree of models to study the impact of a parameter change and perform its optimization. In this contribution, we present a model query mechanism allowing notebook models to query one another. The model dependencies are represented with a graph with suitable processing algorithms. In order to ensure that only affected models are executed we derive and cache a model resolution order. The presented modelling framework relies on open source-technologies (packages: pydantic, Fast API, Jupyter, papermill, scrapbook, containers: Docker and Openshift as well as databases: MongoDB and Redis) and the talk will focus on good practices and design decisions encountered in the process.","day":"2022-07-15","time":680,"endTime":710,"audience":"intermediate","rooms":["Liffey Hall 1"],"slug":"when-models-query-models","type":"talk","speakers":[{"code":"SBZRSP","name":"Michal Maciejewski","biography":"Enthusiastic, hard-working software engineer with contagious energy and passion for working on interdisciplinary projects. Focused on delivering high-quality products in a timely manner. Servant leader always eager to learn from and with team members while instilling the ownership, autonomy, and sense of responsibility. \r\n\r\nOver ten years of experience as a software developer for modelling and analysis of complex systems.  Passionate about model-based system engineering solutions improving existing analysis workflows while ensuring reproducibility. Currently, the lead developer of an MLOps framework to support the design of superconducting accelerator magnets. Formerly, a technical lead for an agile team of experts and scientists creating signal monitoring framework for the Large Hadron Collider.","avatar":null,"slug":"michal-maciejewski","affiliation":"ETH Zurich","homepage":null,"twitter":null}],"start":"2022-07-15T11:20:00+01:00","end":"2022-07-15T11:50:00+01:00"},{"id":"YJYBHC","title":"Super Search with OpenSearch and Python","duration":30,"abstract":"OpenSearch is an open source and free document database with search and aggregation superpowers, based on Elasticsearch. This session covers how to use OpenSearch to perform both simple and advanced searches on semi-structured data such as a product database.","day":"2022-07-15","time":680,"endTime":710,"audience":"intermediate","rooms":["The Auditorium"],"slug":"super-search-with-opensearch-and-python","type":"talk","speakers":[{"code":"ZLLVEH","name":"Laysa Uchoa","biography":"Laysa is a developer working towards a more diverse and fun Python community by organizing Pyladies Munich Chapter. Her passion for sharing knowledge and OSS has led her to work as developer advocate for Aiven. She help users understand databases and do cool things with them. Besides Python, she like cyberpunk movies, tea, and human languages.","avatar":"https://program.europython.eu/media/avatars/DSC_0672_1_wcU720A.jpg","slug":"laysa-uchoa","affiliation":"Aiven","homepage":null,"twitter":"laysauchoa"}],"start":"2022-07-15T11:20:00+01:00","end":"2022-07-15T11:50:00+01:00"},{"id":"ZGSULC","title":"Best practices to open source a product and creating a community around it","duration":30,"abstract":"In certain areas of the industry open source has become mainstream, whether it be a small part of a product, a “community edition of a product”, or creating a whole business around an open source product. One could assume the only thing required to do so is to make the source code of the project publicly accessible, possibly by putting it on a platform such as GitLab or GitHub, and one couldn’t be more wrong.\r\n\r\nIn this talk we explore those aspects such as the licence and the governance of the project and the impact they can have. Then we talk about common mistakes teams make which create an environment where outsiders don’t necessarily feel welcomed to the project. First impressions matter and it’s important that new contributors and users stay once they encounter the project.","day":"2022-07-15","time":680,"endTime":710,"audience":"beginner","rooms":["Wicklow Hall 1"],"slug":"best-practices-to-open-source-a-product-and-creating-a-community-around-it","type":"talk","speakers":[{"code":"HGSWKF","name":"Adrin Jalali","biography":"I'm a computer scientist / bioinformatician who has turned to be a core developer of `scikit-learn` and `fairlearn`, and work as a Machine Learning Engineer at Hugging Face. I'm also an organizer of PyData Berlin.\r\n\r\nThese days I mostly focus on aspects of machine learning and tools which help with creating more ethical and fair decision making systems. This trend has influenced me to work on `fairlearn`, and to work on aspects of `scikit-learn` which would help tools such as `fairlearn` to work more fluently with the package; and at Hugging Face, my focus is to enable the community of these libraries to be able to share their models more easily and be more open about their work.","avatar":"https://program.europython.eu/media/avatars/Farb3SW3229-w-small_mpaHfiN.png","slug":"adrin-jalali","affiliation":"HuggingFace","homepage":"adrin.info","twitter":"@adrinjalali"}],"start":"2022-07-15T11:20:00+01:00","end":"2022-07-15T11:50:00+01:00"}],"type":"timeslot"},{"time":715,"duration":45,"sessions":[{"id":"GFGSGN","title":"Leading & growing software teams","duration":45,"abstract":"Software development is a team game.\r\n\r\nAs you progress through your career, you might end up in a leadership role, taking care of  your own team, or even of multiple teams.\r\n\r\nAs a team lead, it’s up to you to establish a good working rhythm, set the right expectations, communicate up and down the chain of command and effectively help your team grow in both technical and non-technical terms.\r\n\r\nAs a team lead, you want to enable your team to reach its full potential.\r\n\r\nThe main goal of this talk is to provide pragmatic real-life examples, about how to achieve those things.","day":"2022-07-15","time":715,"endTime":760,"audience":"beginner","rooms":["Wicklow Hall 1"],"slug":"leading-growing-software-teams","type":"talk","speakers":[{"code":"GLMZDC","name":"Radoslav Georgiev","biography":"Generalist. A multi-disciplinary problem solver & a technical team lead.\r\n\r\nCurrently leading & growing teams at HackSoft.\r\n\r\nA programmer from ~10 years, studied Computer Science in the Faculty of Mathematics and Informatics, Sofia University.\r\n\r\nFounder and CEO of HackSoft (Sofia based software company with main focus in Python, Django and Scala) and HackBulgaria (Programming courses, based in Sofia / Bulgaria with main focus of getting the students ready for their first job - either as an intern or a junior developer. Mainly focused in Python and Java)\r\n\r\nAlso doing a lot of teaching - Functional Programming classes (Racket / Haskell) @Faculty of Mathematics and Informatics , Programming with Python and Django @HackBulgaria.\r\n\r\nGitHub - https://github.com/RadoRado/","avatar":"https://program.europython.eu/media/avatars/Radoslav_HackSoft_team_AiYbuH9.jpg","slug":"radoslav-georgiev","affiliation":"HackSoft","homepage":"https://www.hacksoft.io/","twitter":"@Rado_g"}],"start":"2022-07-15T11:55:00+01:00","end":"2022-07-15T12:40:00+01:00"},{"id":"HE98XH","title":"Machine Translation engines evaluation framework","duration":30,"abstract":"As an engineers in a ML R&D department of large healthcare enterprise company we were presented with the task to evaluate several Machine Translation engines and choose the one best suited for our corporate needs. To do that we created extendable Python-based framework that allowed us to easily plug-in different Machine Translation engines and compare them across large variety of test datasets with a unified set of quality metrics. Our goal from the start was to create universal MT evaluation framework, that will be useful not only for healthcare domain, but to a wider community as well.\r\n\r\nAt this talk we will present our evaluation framework an will do a walk-through of its capabilities. We also cover how it can be extended to new MT engines, new test datasets and new language pairs. We will also present our evaluation results for several state-of-the-art machine translation engines, both open-source and cloud-based.\r\n\r\nAll the source code of our framework is published to open source:\r\nhttps://github.com/Optum/nmt","day":"2022-07-15","time":715,"endTime":745,"audience":"intermediate","rooms":["Liffey Hall 1"],"slug":"machine-translation-engines-evaluation-framework","type":"talk","speakers":[{"code":"GYFSQB","name":"Anton Masalovich","biography":"Machine learning scientist and engineering manager with 15+ years of experience mostly focused on Natural Language Processing, Machine Translation and Document Recognition.\r\nEx-ABBYY, ex-Microsoft, currently working in a machine learning R&D department of a  large healthcare organization. Have a lot of experience of transforming state-of-the-art ML ideas to actual product features.","avatar":null,"slug":"anton-masalovich","affiliation":"Optum","homepage":null,"twitter":null},{"code":"LZRDNM","name":"Sahil Manchanda","biography":null,"avatar":null,"slug":"sahil-manchanda","affiliation":"Optum","homepage":null,"twitter":null}],"start":"2022-07-15T11:55:00+01:00","end":"2022-07-15T12:25:00+01:00"},{"id":"LLC3KD","title":"Game Development with CircuitPython","duration":45,"abstract":"With a large selection of handheld devices running CircuitPython, it's natural to want to make games for them. But where to start? What are the options available for the hardware, the libraries and other resources? And how do you use all of that? This talk aims to give a gentle introduction for everyone.","day":"2022-07-15","time":715,"endTime":760,"audience":"beginner","rooms":["The Auditorium"],"slug":"game-development-with-circuitpython","type":"talk","speakers":[{"code":"CSLXTY","name":"Radomir Dopieralski","biography":"A Python programmer by day, an electronics hobbyist by night. Building spider robots, hand-held game consoles, ergonomic keyboards and all kinds of gadgets. Very much into CircuitPython.","avatar":"https://program.europython.eu/media/avatars/gogles-big_OCjYWs4.jpg","slug":"radomir-dopieralski","affiliation":"RedHat","homepage":"dopieralski.pl","twitter":"deshipu"}],"start":"2022-07-15T11:55:00+01:00","end":"2022-07-15T12:40:00+01:00"},{"id":"MBJUKF","title":"Work in Progress: Implementing PEP 458 to Secure PyPI downloads","duration":30,"abstract":"[PEP 458](https://peps.python.org/pep-0458/) uses cryptographic signing on PyPI to protect Python packages against attackers. In this talk we will share our lessons learned from the ongoing implementation work in PyPI/Warehouse with the Python community. How does PEP 458 work and what is TUF? What protection can it offer now and what does it enable in the future? And how am I affected as a Python developer and as a user?","day":"2022-07-15","time":715,"endTime":745,"audience":"intermediate","rooms":["Liffey B"],"slug":"work-in-progress-implementing-pep-458-to-secure-pypi-downloads","type":"talk","speakers":[{"code":"ANZZRH","name":"Kairo de Araujo","biography":"I am an Open Source Software Engineer at VMware Inc, a staff member of the VMware Open Source Program Office (OSPO), working on the Security Supply Chain team.\r\nCurrently, I am focused on PyPI.org, Python-TUF, and some contributions to Tern Tools.\r\nAs a Software Engineer, I have contributed to Open Source and writing software since 2013.\r\nI am a former system engineer; however, I use these technologies daily. I have long experience in Infrastructures such as Networking, Cloud, Virtualization, Storage Area Networks, and Storage Disks.\r\nI have worked for IBM, ING, and Forescout in the past.","avatar":"https://program.europython.eu/media/avatars/Kairo_de_Araujo_y22uEvQ.jpg","slug":"kairo-de-araujo","affiliation":"VMware","homepage":"http://kairo.dev","twitter":"@kairoaraujo"},{"code":"H3JGWN","name":"Lukas Pühringer","biography":"Lukas Pühringer is a research scholar and software developer at the NYU Center for Cyber Security (CCS), where he leads the development of The Update Framework (TUF), and has been co-maintaining several of Prof. Justin Cappos’ software projects, most notably the supply chain security framework in-toto. Lukas also supervises students and gives talks about TUF and in-toto.","avatar":null,"slug":"lukas-puhringer","affiliation":"NYU","homepage":null,"twitter":null}],"start":"2022-07-15T11:55:00+01:00","end":"2022-07-15T12:25:00+01:00"},{"id":"MMWYWZ","title":"Applications of Python in Computational Chemistry and Material Design","duration":45,"abstract":"Computational chemistry is the branch of chemistry that studies chemical systems through simulation and involves HPC architecture and software packages. Python has become an integral part of computational modelling of materials in recent years, with development of packages such as the Atomic Simulation Environment (ASE) which is a set of modules for manipulating, running and visualising atomic simulation. Furthermore, ASE integrates seamlessly with many electronic structure software packages, used for calculating the energy and properties of systems based on some level of theory, e.g Density Functional Theory (DFT). Moreover, the combination with other Python packages that integrate with ASE provide an ecosystem for atomic simulations. Packages such as CatLearn, a machine-learning approach used for calculating energies needed for reactions, along with Phonopy and FHI-vibes, both are for studying lattice dynamics of materials, to name a few, provide a comprehensive toolkit for the computational study of materials and chemical systems\r\n\r\nIn our research, such approaches are essential to further our understanding of materials and chemical processes, and of particular interest are materials for green and sustainable processes, such as catalysts used to produce fossil fuel alternatives. In this regard, as Python software becomes increasingly popular for the simulation and study of materials, it also provides the tools and methods needed for tackling some of the challenges of today","day":"2022-07-15","time":715,"endTime":760,"audience":"","rooms":["Forum"],"slug":"applications-of-python-in-computational-chemistry-and-material-design","type":"poster","speakers":[{"code":"9W9CWW","name":"Owain Beynon","biography":"PhD Student in Computational Chemistry at Cardiff University. \r\nResearch interests: software development, material science, catalysis, solid state physics.","avatar":null,"slug":"owain-beynon","affiliation":"Cardiff University","homepage":"https://www.cardiff.ac.uk/","twitter":"@owainbeynon"}],"start":"2022-07-15T11:55:00+01:00","end":"2022-07-15T12:55:00+01:00"},{"id":"PQADBJ","title":"Unfolding the paper windmills","duration":30,"abstract":"Research is done on the shoulders of giants. Luckily and unluckily, those giants spoke paper-English and documented their achievements kind of publicly so we could advance the science. \r\n\r\nIn this talk, we will dissect the structure of a paper, looking for the essential points that will help us understand it and implement it. Following we will get our hands dirty and implement the paper using Python. \r\nIn particular, we will dive into the seminal paper \"Attention is all you need\" and implement a transformer using JAX.\r\n\r\nThe key takeaways from this talk are:\r\n - Demystify academic reading.\r\n - Understand the Transformer architecture.\r\n - An introduction to the JAX ecosystem.","day":"2022-07-15","time":715,"endTime":745,"audience":"intermediate","rooms":["Liffey Hall 2"],"slug":"unfolding-the-paper-windmills","type":"talk","speakers":[{"code":"7T3KC8","name":"Mai Giménez","biography":"Mai Giménez is a research engineer working at Deepmind. She holds a PhD in natural language processing, and her main research interest is in language and the sociotechnical impacts of these models in the real world.\r\nShe's a former board member of the Spanish Python Association, helped organise several PyConES conferences and is a proud member of the Pyladies.","avatar":"https://program.europython.eu/media/avatars/image_iYEZORj.png","slug":"mai-gimenez","affiliation":"Deepmind","homepage":null,"twitter":null}],"start":"2022-07-15T11:55:00+01:00","end":"2022-07-15T12:25:00+01:00"},{"id":"TE7K7D","title":"Clean Architectures in Python","duration":45,"abstract":"A brief talk that introduces software developers to the idea of \"clean architecture\" and discusses how to reduce coupling between parts of a software system through well-known strategies such as abstraction and inversion of control.","day":"2022-07-15","time":715,"endTime":760,"audience":"intermediate","rooms":["Liffey A"],"slug":"clean-architectures-in-python","type":"talk","speakers":[{"code":"7BS3PU","name":"Leonardo Giordani","biography":"Born in 1977 together with Star Wars, bash, Apple ][, Dire Straits, The Silmarillion, and many other great things.\r\n\r\nI started coding in April 1987 on a Sinclair ZX Spectrum. I then moved to MS-DOS PCs and in 1996 I started using Linux and became interested in operating system internals. I love software architectures, algorithms, mathematics and cryptography.\r\n\r\nI’m mainly interested in open source software. I like both the theoretical and practical aspects of computer science.\r\n\r\nI am currently working as a contractor DevOps and Python developer while I design a DevOps bootcamp that I will run in London from October 2022.\r\n\r\nFrom 2013 I blog some technical thoughts at http://thedigitalcatonline.com.\r\n\r\nIn 2018 I published the free book “Clean Architectures in Python” http://bit.ly/getpycabook","avatar":"https://program.europython.eu/media/avatars/Avatar400x400_cuVmtE6.jpg","slug":"leonardo-giordani","affiliation":"The Digital Cat Services","homepage":"https://www.thedigitalcatonline.com/","twitter":"@tw_lgiordani"}],"start":"2022-07-15T11:55:00+01:00","end":"2022-07-15T12:40:00+01:00"}],"type":"timeslot"},{"time":780,"title":"Lunch Break","duration":60,"type":"break"},{"time":840,"duration":30,"sessions":[{"id":"8RH3BC","title":"Saving Lives with Predictive Geo - AI","duration":30,"abstract":"Leveraging geospatial Python libraries to understand and predict High-risk houses during cyclone-induced floods in urban areas considering historical openly available satellite images and urban morphological data.\r\n\r\nAssigning a flood risk score to each individual house near the coastal regions is a challenge. Also, as the land characteristics vary based on different geographical locations, prepare for emergencies on demand.    ​\r\n\r\n​","day":"2022-07-15","time":840,"endTime":870,"audience":"intermediate","rooms":["Liffey Hall 2"],"slug":"saving-lives-with-predictive-geo-ai","type":"talk","speakers":[{"code":"33UKLN","name":"Sumedh Ghatage","biography":"Sumedh Ghatage is an Associate Lead Data Scientist (Geospatial) at Gramener. He has worked on various smart city initiatives including sectors such as environmental resource management, location intelligence, and disaster management projects.\r\n\r\nHe drives a community called “Geospatial Awareness Hub” which helps enable Education, Employment, and Business to foster the growth and awareness of the Geospatial Industry","avatar":"https://program.europython.eu/media/avatars/profile-pic_T1gCApf.png","slug":"sumedh-ghatage","affiliation":"Gramener","homepage":"https://gramener.com/","twitter":"@GhatageSumedh"}],"start":"2022-07-15T14:00:00+01:00","end":"2022-07-15T14:30:00+01:00"},{"id":"9EH9PG","title":"Packaging security with Nix","duration":30,"abstract":"Managing securely dependencies is becoming an increasing concern of the industry. Here, we showcase how Nix, a functional-oriented package manager, can get us very far and close class of vulnerabilities that PyPI / pip had in the past, e.g. rogue PyPI packages that steals personal data.","day":"2022-07-15","time":840,"endTime":870,"audience":"intermediate","rooms":["Liffey A"],"slug":"packaging-security-with-nix","type":"talk","speakers":[{"code":"ADBNZ8","name":"Ryan Lahfa","biography":"FOSS developer, Nix expert, software engineering expert with a love for formal methods and mathematics.","avatar":null,"slug":"ryan-lahfa","affiliation":"French Ministry of Justice / École normale supérieure d'Ulm","homepage":"https://ryan.lahfa.xyz/about-me.html","twitter":null}],"start":"2022-07-15T14:00:00+01:00","end":"2022-07-15T14:30:00+01:00"},{"id":"QJDCYS","title":"Dr. Jekyll & Mr. Hyde - transition from developer to manager without going crazy or becoming evil","duration":30,"abstract":"In the career of many developers, there comes the point of deciding \"what next?\". The typical two choices are- to stay on the technical path and pursue the way of a software architect or take a leap of faith and jump to a people management role. In my talk, I'll show you the pros, cons, and challenges of pursuing the latter.","day":"2022-07-15","time":840,"endTime":870,"audience":"beginner","rooms":["Wicklow Hall 1"],"slug":"dr-jekyll-mr-hyde-transition-from-developer-to-manager-without-going-crazy-or-becoming-evil","type":"talk","speakers":[{"code":"8B79FL","name":"Jakub Paczkowski","biography":"Python development enthusiast for the last 11 years, currently working as Director of Engineering at SpotOn. I love clean and straightforward solutions, focused on usability and robustness. I am privately a motorcycling enthusiast in summer and squash lover in winter.","avatar":"https://program.europython.eu/media/avatars/T02G0JQBC-UUTHKAS8N-5842edf034ff-512_JnL4JO5.jpeg","slug":"jakub-paczkowski","affiliation":"SpotOn","homepage":"https://www.spoton.com/","twitter":"jpaczkowski"}],"start":"2022-07-15T14:00:00+01:00","end":"2022-07-15T14:30:00+01:00"},{"id":"QYRKGA","title":"Education Panel","duration":60,"abstract":"Teaching Python: a panel discussion with perspectives from teachers, academics, makers and enthusiasts. Why is Python appealing in education? What tools and resources work well? What can the Python community do to help teachers & policy makers? Join us for an engaging and insightful discussion with a fascinating panel of experts, Dr Keith Quille, Kelly Schuster-Paredes, Chris Reina and Sarah-Jayne Carey.","day":"2022-07-15","time":840,"endTime":900,"audience":"intermediate","rooms":["The Auditorium"],"slug":"education-panel","type":"panel","speakers":[{"code":"JSBMWD","name":"Chris Reina","biography":"Chris Reina has been involved in education since 2002, technology since 1981 and Making since 1971. (You do the maths). He is CCO (Chief Cardboard Officer) of MakerMeet.ie - who deliver Maker-led, project-based S.T.E.A.M. workshops nationwide to primary, secondary, third-level and other institutions.\r\nHe feels passionately that education is the most important thing in the world and that teaching using Maker skills is the most rewarding job there is.\r\nChris loves cats, kayaking, kite-flying, steampunk, pedantic semantics and knowing the meanings of ligatures, aglets, gallibanders and lexiphanic.","avatar":"https://program.europython.eu/media/avatars/MakerMeetIE_LOGO_M_cheCwbb.png","slug":"chris-reina","affiliation":"MakerMeet IE","homepage":"https://www.makermeet.ie/","twitter":"@makermeetie  |  @chrisreina"},{"code":"WKRLRJ","name":"Kelly Schuster - Paredes","biography":"Kelly Schuster-Paredes is the co-host of the Teaching Python Podcast, a mom, world traveler, and teacher.  Kelly has a Masters in Curriculum, Instruction, and Technology from Nova Southeastern University. She has taught in the UK, Peru, and the USA. Kelly specializes in curriculum design, educational coaching, and curriculum development. She got started with integrating technology in the classroom in 2003, dabbled with app design in File Maker, HTML, Robotics, and now spends most of her time learning more Python. She teaches Python and Computer Science to sixth, seventh and eighth grade students at Pine Crest School in Fort Lauderdale, Florida.","avatar":"https://program.europython.eu/media/avatars/IMG_3994_utfoOyN.jpeg","slug":"kelly-schuster-paredes","affiliation":null,"homepage":null,"twitter":null},{"code":"UAHSLS","name":"Aimée Fagan","biography":"Dublin-born, now London-based, Aimée works as Head of Partnerships for the Micro:bit Educational Foundation, a nonprofit with a mission to 'inspire every child to create their best digital future'. The Foundation is behind the tiny-but-mighty BBC micro:bit device, a programmable microcontroller designed for education and loved the world over. Aimée works with a wide range of partners across Europe, Middle East and Africa to ensure students and teachers have the resources and support they need to get hands on with physical computing and block- or text-based programming.","avatar":"https://program.europython.eu/media/avatars/aimee_linkedin_gzMtlft.jpeg","slug":"aimee-fagan","affiliation":"Micro:bit Educational Foundation","homepage":null,"twitter":"@aimseroo"},{"code":"DUNTUQ","name":"Keith Quille","biography":"I am a Senior Lecturer of computing in the School of Enterprise Computing and Digital Transformation in TU Dublin. My primary area of research is in Computer Science Education (with an emphasis on inclusion) which spans third, second and primary level’s. The main focus of my research at third level (including my PhD) was the early identification of students who were at risk of failing or dropping out of Computer Science (using machine learning techniques), as well as interventions to try and reduce attrition rates. My research also focuses on gender and inclusion, with an aim to reduce stereotypes and promote the Computer Science discipline across all levels of education. I am the co-chair of the ACM ITiCSE conference for 2022. My primary area of teaching is in Software Development, (CS1 and CS2: C#, Java and Python) and Applied Machine Learning with Artificial Intelligence. To complement my Computer Science Education research at third level, I have also been significantly involved at primary and second level Computer Science Education, from Governmental level with commissioned research, to co-authoring the leaving certificate book, to formal and informal teacher professional development, to leading a large scale national, primary and second level Computer Science outreach and research programme (http://CSinc.ie). I am also a member of the EU Commission expert group on AI and data in education and training.","avatar":"https://program.europython.eu/media/avatars/KeithQuille_Lhqkjlv.jpg","slug":"keith-quille","affiliation":null,"homepage":null,"twitter":null},{"code":"MYEWSN","name":"Sarah-Jayne Carey","biography":"Sarah-Jayne Carey is the ICT-Co-Ordinator and Computer Science and coding teacher in Coláiste Bride Presentation Secondary School- a large girls school  in Dublin.\r\nShe has over 20 years teaching experience-including further and higher education. She is on the  executive of the subject association for Leaving Certificate Computer Science - CESI ( Computers in Education Society of Ireland)\r\nShe is a part-time lecturer in Maynooth University and Dublin City University, working with pre-service computer science teachers, and also works with the PDST( Professional Development Service for Teachers) with the Computer Science Team. \r\nShe is passionate about promoting coding and computer science for all, and making her students aware of the many career options and possibilities in tech. She believes in using digital technologies to empower students, and to improve and enhance education and learning for the whole school community.\r\nShe started learning Python, to be able to teach Python - and still feels like a student - always learning!","avatar":"https://program.europython.eu/media/avatars/SJC_Headshot_M0hJNV0.JPG","slug":"sarah-jayne-carey","affiliation":null,"homepage":null,"twitter":null}],"start":"2022-07-15T14:00:00+01:00","end":"2022-07-15T15:00:00+01:00"},{"id":"SGP3PM","title":"Rapid prototyping in BBC News with Python and AWS","duration":30,"abstract":"BBC News Labs is an innovation team within BBC R&D, working with journalists and production teams to build prototypes to demonstrate and trial new ideas for ways to help journalists or bring new experiences to audiences.\r\n\r\nWorking in short project cycles, it's important for us to be able to quickly build processing pipelines connected to BBC services, test and iterate on ideas and demonstrate working prototypes. We make use of modern cloud technologies to accelerate delivery and reduce friction.\r\n\r\nIn this talk I will share our ways of working, our ideation and research methods, and the tools we use to be able to build, deploy and iterate quickly, the BBC's cloud deployment platform, and our use of serverless AWS services such as Lambda, Step Functions and Serverless Postgres.","day":"2022-07-15","time":840,"endTime":870,"audience":"intermediate","rooms":["Liffey B"],"slug":"rapid-prototyping-in-bbc-news-with-python-and-aws","type":"talk","speakers":[{"code":"EWRKHR","name":"Ben Nuttall","biography":"Ben is a senior software engineer in BBC News Labs, an innovation team in BBC R&D. Ben was previously community manager at Raspberry Pi.","avatar":"https://program.europython.eu/media/avatars/bennuttall-redhat_m2sZ9q2.jpg","slug":"ben-nuttall","affiliation":"BBC News Labs","homepage":"https://bbcnewslabs.co.uk/","twitter":"@ben_nuttall"}],"start":"2022-07-15T14:00:00+01:00","end":"2022-07-15T14:30:00+01:00"},{"id":"VXJK3Z","title":"Packaging Python in 2022","duration":30,"abstract":"Packaging in Python is one place where the common adage \"There should be one and preferably only one obvious way to do it\" doesn't seem to apply. There are a lot of choices to make when publishing python code. What is absolutely essential and what is optional?","day":"2022-07-15","time":840,"endTime":870,"audience":"intermediate","rooms":["Liffey Hall 1"],"slug":"packaging-python-in-2022","type":"talk","speakers":[{"code":"8YFYD9","name":"Jeremiah Paige","biography":"I am a long time Python developer of almost a decade. For most of that time I have used the language to drive systems programs in and on top of C. Python is a diverse and quickly growing community and I love to contribute to it even as I try to keep up. I currently help ActiveState deliver secure, pre-build python projects to enterprise customers and individual developers.","avatar":"https://program.europython.eu/media/avatars/FB_IMG_1479148712979_7HSytv7.jpg","slug":"jeremiah-paige","affiliation":"ActiveState","homepage":null,"twitter":"@ucodery"}],"start":"2022-07-15T14:00:00+01:00","end":"2022-07-15T14:30:00+01:00"}],"type":"timeslot"},{"time":875,"duration":30,"sessions":[{"id":"9PQZKF","title":"Write Docs Devs Love: Ten Tricks To Level Up Your Tech Writing","duration":30,"abstract":"Tutorials, blog posts, and product docs help developers learn. From our favorite tutorials to bad product docs we all consume technical writing. But what makes for good technical writing? In this talk I’ll share 10 tips and tricks to improve your technical writing skills to help your readers succeed","day":"2022-07-15","time":875,"endTime":905,"audience":"beginner","rooms":["Wicklow Hall 1"],"slug":"write-docs-devs-love-ten-tricks-to-level-up-your-tech-writing","type":"talk","speakers":[{"code":"SN9SZQ","name":"Mason Egger","biography":"Mason is currently a Developer Advocate at Gretel. Prior to his work at Gretel, he was a Developer Advocate at DigitalOcean. Prior to this he was an SRE helping build and maintain a highly available hybrid multicloud PaaS. He is an avid programmer, speaker, educator, and writer. He is an organizer of PyTexas and actively contributes to open source projects. In his spare time he enjoys reading, camping, kayaking, and exploring new places.","avatar":"https://program.europython.eu/media/avatars/attachment_6_Dicge7M.jpeg","slug":"mason-egger","affiliation":"Gretel","homepage":"https://mason.dev","twitter":"@masonegger"}],"start":"2022-07-15T14:35:00+01:00","end":"2022-07-15T15:05:00+01:00"},{"id":"BADDYW","title":"Secure Python ML: The Major Security Flaws in the ML Lifecycle (and how to avoid them)","duration":30,"abstract":"Every phase across the end-to-end machine learning lifecycle exposes a plethora of security risks that often go unnoticed by machine learning practitioners. In this talk we uncover the most critical (and common) security risks in the machine learning lifecycle, covering in-depth concepts as well as practical examples of ways in which these can be exploited as well as resolved and mitigated (analogous to the OWASP Top 10 industry standard). \r\n\r\nThroughout the talk we will be using a hands on example, where we will be training, packaging and deploying a model from scratch, outlining key risk areas for each step together with tools and practices that can be used to mitigate these risks. By the end of this talk, machine learning practitioners will have a robust intuition of the importance of security best practices throughout the machine learning lifecycle, together with tools and frameworks that can help mitigate undesirable outcomes due to security flaws.","day":"2022-07-15","time":875,"endTime":905,"audience":"intermediate","rooms":["Liffey B"],"slug":"secure-python-ml-the-major-security-flaws-in-the-ml-lifecycle-and-how-to-avoid-them","type":"talk","speakers":[{"code":"EQMGKH","name":"Alejandro Saucedo","biography":"Alejandro is the Chief Scientist at the Institute for Ethical AI & Machine Learning, where he contributes to policy and industry standards on the responsible design, development and operation of AI, including the fields of explainability, GPU acceleration, privacy preserving ML and other key machine learning research areas. Alejandro Saucedo is also Director of Engineering at Seldon Technologies, where he leads teams of machine learning engineers focused on the scalability and extensibility of machine learning deployment and monitoring products. With over 10 years of software development experience, Alejandro has held technical leadership positions across hyper-growth scale-ups and has a strong track record building cross-functional teams of software engineers. He is currently appointed as governing council Member-at-Large at the Association for Computing Machinery, and is currently the Chairperson of the GPU Acceleration Kompute Committee at the Linux Foundation.\r\n\r\nLInkedin: https://linkedin.com/in/axsaucedo\r\nTwitter: https://twitter.com/axsaucedo\r\nGithub: https://github.com/axsaucedo\r\nWebsite: https://ethical.institute/","avatar":"https://program.europython.eu/media/avatars/aletechuk-high-res_m9IQ6Nl.png","slug":"alejandro-saucedo","affiliation":"The Institute for Ethical AI & Machine Learning","homepage":"https://ethical.institute/","twitter":"axsaucedo"}],"start":"2022-07-15T14:35:00+01:00","end":"2022-07-15T15:05:00+01:00"},{"id":"GAVCZ8","title":"Try Something Different: Explore MicroPython! (a rough guide for newcomers)","duration":30,"abstract":"MicroPython - a reimplementation of Python for microcontrollers - is nine years old. How can you find your way in a jungle of tiny chips, circuits, and jumper wires? In this session, we will run through a brief introduction to the world of MicroPython. Beyond the basics, we will explore the projects, tools, and the  community that helped your intrepid speaker to get started as a newcomer.","day":"2022-07-15","time":875,"endTime":905,"audience":"beginner","rooms":["Liffey Hall 2"],"slug":"try-something-different-explore-micropython-a-rough-guide-for-newcomers","type":"talk","speakers":[{"code":"HYCU7H","name":"Andy Piper","biography":"Developer Advocate. API tinkerer. Friendly DEV.to moderator & community helper. IoT hacker (Eclipse IoT / MQTT). Perpetual student. LEGO fan. Prefer they/them pronouns.","avatar":"https://www.gravatar.com/avatar/1526dcb784188b422544c6344ef223c2","slug":"andy-piper","affiliation":"Twitter","homepage":"https://andypiper.me","twitter":"@andypiper"}],"start":"2022-07-15T14:35:00+01:00","end":"2022-07-15T15:05:00+01:00"},{"id":"PAXMHN","title":"Native Packaging of GUI Apps on Windows and macOS","duration":30,"abstract":"Distributing Python GUI applications to end users is a challenge: will they need to install Python? If so, which version? If not, how do they install the application? From a random ZIP file? How native does the process feel? Will their system trust your code? For a fluid experience, it needs to be signed and (on macOS) notarized beforehand.\r\n\r\nWelcome to [`pup`](https://pypi.org/project/pup/), the tool that the [Mu Editor](https://codewith.mu/) development team has created to package and distribute it in platform-native formats to Windows and macOS users around the world.\r\n\r\nIn this session I will show how `pup` can be used to package GUI Applications for distribution: natively on Windows and macOS, and in early stages of development for distribution-agnostic Linux artifacts. In short, if it's `pip`-installable it is `pup`-packageable!\r\n\r\nI will then describe the way `pup` works (and how it differs from comparable tools) leading on to a call-for-action moment, where I'll share its current state of development, what's good, what's bad, and where I'd like it to be headed to.\r\n\r\nI'll wrap up the talk with a set of future-looking thoughts that `pup` has helped identify not only on the specifics of CPython's distribution, but also on the Python ecosystem as whole.","day":"2022-07-15","time":875,"endTime":905,"audience":"intermediate","rooms":["Liffey Hall 1"],"slug":"native-packaging-of-gui-apps-on-windows-and-macos","type":"talk","speakers":[{"code":"SS7TTG","name":"Tiago Montes","biography":"Freelance Consultant and Trainer with lots of experience on back-end development and architecture, relational and spatial databases, networks, infrastructure, automation, and more.\r\n\r\nMember of the Mu Editor development team.\r\n\r\nWhat matters is learning, having fun, and being and making others happy! :-)","avatar":"https://program.europython.eu/media/avatars/tiago.montes_cgAAO1f.png","slug":"tiago-montes","affiliation":"Independent","homepage":"https://tmont.es/","twitter":"@setnomt"}],"start":"2022-07-15T14:35:00+01:00","end":"2022-07-15T15:05:00+01:00"},{"id":"TXFX77","title":"Automated Refactoring Large Python Codebases","duration":30,"abstract":"Like many companies with multi-million-line Python codebases, Carta has struggled to adopt best practices like Black formatting and type annotation. The extra work needed to do the right thing competes with the almost overwhelming need for new development, and unclear code ownership and lack of insight into the size and scope of type problems add to the burden. We’ve greatly mitigated these problems by building an automated refactoring pipeline that applies Black formatting and backfills missing types via incremental Github pull requests. Our refactor applications use LibCST and MonkeyType to modify the Python syntax tree and use GitPython/PyGithub to create and manage pull requests. It divides changes into small, easily reviewed pull requests and assigns appropriate code owners to review them. After creating and merging more than 3,000 pull requests, we have fully converted our large codebase to Black format and have added type annotations to more than 50,000 functions. In this talk, you’ll learn to use LibCST to build automated refactoring tools that fix general Python code quality issues at scale and how to use GitPython/PyGithub to automate the code review process.\r\nSlides: https://www.slideshare.net/jimmy_lai/europython-2022-automated-refactoring-large-python-codebases","day":"2022-07-15","time":875,"endTime":905,"audience":"intermediate","rooms":["Liffey A"],"slug":"automated-refactoring-large-python-codebases","type":"talk","speakers":[{"code":"7DHKEF","name":"Jimmy Lai","biography":"Jimmy Lai is a Software Engineer in Instagram and Carta Infrastructure. He love Python and like to share his love in tech talks. His recent interest is automated refactoring and his prior sharing topics include profiling, optimization, asyncio and type annotations.","avatar":"https://www.gravatar.com/avatar/c7a34d0a6215dd653bfd8b952f3d7cf6","slug":"jimmy-lai","affiliation":"Instagram and Carta","homepage":null,"twitter":null}],"start":"2022-07-15T14:35:00+01:00","end":"2022-07-15T15:05:00+01:00"}],"type":"timeslot"},{"time":905,"title":"Coffee Break","duration":25,"type":"break"},{"time":930,"duration":30,"sessions":[{"id":"3ZGCQR","title":"Python for Arts, Humanities and Social Sciences","duration":30,"abstract":"Computational methods particularly those involving data analytics are now taking root in various humanities disciplines. However, students and researchers working in these disciplines lack the necessary programming proficiency and coding experience . The need then arises to make Python-based computational methods accessible – we present case-studies of how to do this via various Python modules being taught at College of Business in Technological University Dublin and by means of walkthrough of an interdisciplinary social good project called InEire. It comes down to complementing existing quantitative and qualitative methods with methods based on analysis of various types of data specific to the social science problem being solved. We essentially go through the process of building curiosity-driven exploration in social science students via a theoretically driven research question rather than the Python technique itself, and then focusing on the various steps involved in solving that question; and finally boiling it down to a concrete Python-based data analytics methodology. This project-based teaching methodology helped us develop Python skills in newbies eventually leading to a Python-based data analytic skills in students of disciplines other than Computer Science.","day":"2022-07-15","time":930,"endTime":960,"audience":"beginner","rooms":["Liffey A"],"slug":"python-for-arts-humanities-and-social-sciences","type":"talk","speakers":[{"code":"7CNJVE","name":"Arjumand Younus","biography":"Dr Arjumand Younus is a Research Scientist in Afiniti AI, and a part-time lecturer in Technological University Dublin. Before this appointment, Arjumand has contributed to SFI funded projects during her different post-doctoral positions at CONSUS-UCD and INSIGHT-UCD. She is also serving in the capacity of co-director for Women in Research Ireland which is a volunteer-run registered charity working for better representation of women and under-represented groups in academia.\r\n\r\nArjumand received a joint PhD in Computer Science from National University of Ireland Galway (Ireland) and University of Milano-Bicocca (Italy), MS degree in Computer Science from Korea Advanced Institute of Science and Technology (South Korea), and BS in Computer Science from the University of Karachi (Pakistan). Her research focuses on Machine Learning, Natural Language Processing, and Data Science for Social Good. Arjumand is passionate about the value of artificial intelligence technology to make society better, and at the moment is involved as an academic partner in various AI for Social Good projects.","avatar":"https://program.europython.eu/media/avatars/headshot_arjumandyounus_KdYrxO6.jpg","slug":"arjumand-younus","affiliation":"Afiniti AI","homepage":"https://arjumandyounus.github.io/","twitter":"ArjumandYounus"},{"code":"AY9Z73","name":"Dr. Muhammad Atif Qureshi","biography":null,"avatar":null,"slug":"dr-muhammad-atif-qureshi","affiliation":null,"homepage":null,"twitter":null}],"start":"2022-07-15T15:30:00+01:00","end":"2022-07-15T16:00:00+01:00"},{"id":"7UYS9V","title":"Demystifying Python’s Internals: Diving into CPython by implementing a pipe operator","duration":30,"abstract":"Diving into the CPython source code can feel daunting. Whether you want to start contributing or just want to get a better understanding of Python by exploring its source code, it’s often difficult to know where to start or what you’re missing.\r\n\r\nIn my talk, I will show you around the CPython source code by implementing a new operator, a pipe operator. While doing so, I will discuss core parts of the internals, such as Python’s grammar, its syntax trees, and the underlying logic that will perform the operation. By the end, you will have a good idea of the moving parts involved in core language features.\r\n\r\nI will also take you through the steps necessary to make it all work. I’ll show you how I obtained a copy of the source code, regenerated the parser and token files, and how I compiled my modified version of CPython. I will also write and run tests to help me implement my changes. This should give you a mental framework that helps you while diving into more comprehensive resources, like the excellent [Python Developer’s Guide](https://devguide.python.org/).\r\n\r\nMy talk is aimed at everyone who wants to explore CPython’s internals. You don’t have to be an expert in Python, although some affinity with Python helps with understanding the internals. I will also use C to implement some of the operator logic, but knowledge of C is by no means required. In short, if you’re interested in diving into the CPython source code, this talk is for you.","day":"2022-07-15","time":930,"endTime":960,"audience":"intermediate","rooms":["The Auditorium"],"slug":"demystifying-pythons-internals-diving-into-cpython-by-implementing-a-pipe-operator","type":"talk","speakers":[{"code":"UPWXFZ","name":"Sebastiaan Zeeff","biography":"Sebastiaan is a Software Engineer for the Ordina Pythoneers and a Fellow of the Python Software Foundation. He has a passion for teaching Python and writing clean code. Sebastiaan is also active in the Python community, as an owner of Python Discord, open-source contributor, Python educator, and FinAid team lead for EuroPython. As a public speaker, he makes frequent appearances at Python conferences, including various regional PyCons, EuroPython, FOSDEM, and Pyjamas Conf. Sebastiaan lives in The Netherlands.","avatar":"https://program.europython.eu/media/avatars/photo_cropped_mqQp3VS.jpg","slug":"sebastiaan-zeeff","affiliation":"Ordina Pythoneers","homepage":"https://sebastiaanzeeff.nl","twitter":"@SebastiaanZeeff"}],"start":"2022-07-15T15:30:00+01:00","end":"2022-07-15T16:00:00+01:00"},{"id":"BZL7YY","title":"How a popular MMORPG made me a better developer","duration":30,"abstract":"Have you heard of the critically acclaimed MMORPG Final Fantasy XIV?\r\n\r\nAs an active player since 2015, I've used my \"problem-solving programmer brain\" to analyze my experiences in the world of Eorzea and apply them into important software lessons. From finding solutions to a housing crisis, to tracking cheaters, to networking with the president of Square Enix and applying the principles of (Y)MINASWAN, there's a lot to be learned through triumphs and failures as an MMO gamer. I will also talk about my experiences in the software community as a neurodivergent developer, and how gaming helped me break down barriers.","day":"2022-07-15","time":930,"endTime":960,"audience":"intermediate","rooms":["Wicklow Hall 1"],"slug":"how-a-popular-mmorpg-made-me-a-better-developer","type":"talk","speakers":[{"code":"3CVRJD","name":"Valerie Shoskes","biography":"A lifelong gamer, cat mom, and abstract thinker who discovered software development by writing scripts with python in her college years and never looked back. She lives in Cleveland, Ohio, with her friends and three cats. She brings her perspective of neurodivergence in coding with her six years of professional development.","avatar":"https://program.europython.eu/media/avatars/60753290_234917830798883_1901400361449553920_n_wNXvY1e.jpg","slug":"valerie-shoskes","affiliation":"Bendyworks","homepage":null,"twitter":null}],"start":"2022-07-15T15:30:00+01:00","end":"2022-07-15T16:00:00+01:00"},{"id":"JBTGFL","title":"Build your own Playlist Recommender System with Python using your GDPR Data","duration":30,"abstract":"In my talk, we explore our usage data requested according to GDPR and leverage it - together with Spotify’s Web API - to build a personalized playlist recommender system with Python.\r\n\r\nIn 2018, the General Data Protection Regulation (GDPR) became effective in the EU. It sometimes causes data scientists great headaches. But from a consumer and Pythonista point of view this can also be interesting data for exploration. It is very useful for building personalization technology, in particular recommender systems. And there are almost endless ways to use Python for it.\r\nSo, let’s request and use our own data to build a playlist recommender system which infers our music taste from our streaming history and uses it to retrieve songs from our favorites in a new way. We will call it “Your Rediscover Past”, a personalized playlist based on your streaming history and saved songs.","day":"2022-07-15","time":930,"endTime":960,"audience":"intermediate","rooms":["Liffey Hall 1"],"slug":"build-your-own-playlist-recommender-system-with-python-using-your-gdpr-data","type":"talk","speakers":[{"code":"G8LVXX","name":"Marcel Kurovski","biography":"Senior Data Scientist and Innovation Lead at inovex\r\nHost of Recsperts - Recommender Systems Experts, the Podcast Show with industry and academia experts in Recommender Systems\r\nBuilding Recommenders and Personalization Solutions with Python for various industries since 5+ years\r\nCreator and Instructor of Python RecSys Training","avatar":"https://program.europython.eu/media/avatars/gh_avatar_94Jm1CM.png","slug":"marcel-kurovski","affiliation":"inovex GmbH","homepage":"https://www.recsperts.com/","twitter":"@LivesInAnalogia"}],"start":"2022-07-15T15:30:00+01:00","end":"2022-07-15T16:00:00+01:00"},{"id":"TDUFJ9","title":"From circuit board design to finished product: the hobbyist’s guide to hardware manufacturing","duration":30,"abstract":"Ever wondered how hardware is made, or curious about making your own? \r\n\r\nWe share our experiences manufacturing a programmable gamepad for use in IoT/MicroPython workshops. \r\n\r\nWe will cover the entire production process, including:\r\n\r\n- Designing the PCB (Printed Circuit Board)\r\n- Choosing microcontroller and parts\r\n- Finding, ordering and assembling components\r\n- Pulling together firmware, drivers and software\r\n\r\nMistakes were indeed made along the way. Let's turn them into valuable lessons!","day":"2022-07-15","time":930,"endTime":960,"audience":"intermediate","rooms":["Liffey Hall 2"],"slug":"from-circuit-board-design-to-finished-product-the-hobbyists-guide-to-hardware-manufacturing","type":"talk","speakers":[{"code":"HBPEU7","name":"Sebastian Roll","biography":"Sebastian is a consultant, speaker and workshop organizer.\r\n\r\nHe has ten years of experience spanning Oil & Gas, Industrial IT and IoT. His main areas of interest include consulting practices, IoT and Python.","avatar":"https://program.europython.eu/media/avatars/Sebastian_Roll_lxEMZjv.jpg","slug":"sebastian-roll","affiliation":"Retraze","homepage":null,"twitter":null}],"start":"2022-07-15T15:30:00+01:00","end":"2022-07-15T16:00:00+01:00"},{"id":"WVFUYA","title":"Handling Errors the Graceful Way in Python","duration":30,"abstract":"Things rarely go as planned, especially in the world of programming. Errors are the bane of a programmer’s existence. You write an awesome piece of code, are ready to execute it and build a powerful machine learning model, and then poof. Python throws up an unexpected error, ending your hope of quick code execution.","day":"2022-07-15","time":930,"endTime":960,"audience":"intermediate","rooms":["Liffey B"],"slug":"handling-errors-the-graceful-way-in-python","type":"talk","speakers":[{"code":"ND3VKT","name":"Riya Bansal","biography":"Riya Bansal is an enthusiastic and passionate Software Engineer at Microsoft with 3 years of experience with enterprise volume licensing products and Microservice technologies. Riya has a lot of experience working with Data Lakes as well. She has worked from small-sized Startups to large MNCs and gained a lot of experience over the years.\r\nShe is a big Pythonista and really interested in writing Python considering the best practices. Apart from that, Riya has also led an amazing Python Community which is a volunteer-driven organization of amazing Pythonistas, enthusiasts, entrepreneurs, researchers, students, and many more with a primary interest in Python.\r\nShe has also been awarded the Google Women Tech makers Scholarship for her leadership skills and impact on the community of women in tech as well.  She has mentored over 10000+ students in the past.","avatar":"https://program.europython.eu/media/avatars/Me_0z8yiRT.JPG","slug":"riya-bansal","affiliation":"Microsoft","homepage":null,"twitter":"riyabansal1998"}],"start":"2022-07-15T15:30:00+01:00","end":"2022-07-15T16:00:00+01:00"}],"type":"timeslot"},{"time":965,"duration":45,"sessions":[{"id":"QPDML3","title":"Friday Lightning Talks","duration":45,"abstract":"A lightning talk (LT) is a short presentation that must not be longer than five minutes.\r\n\r\nTo sign up for a lightning talk, you can put your name on the information board during the conference before the second coffee break. For our online participants, we will set up a separate form or Google sheet for you to put your name and topic in - similar to how we run this at the in-person conference. \r\n\r\nWe will announce the same every day both online and in person.","day":"2022-07-15","time":965,"endTime":1010,"audience":"intermediate","rooms":["The Auditorium"],"slug":"friday-lightning-talks","type":"lightning-talks","speakers":[],"start":"2022-07-15T16:05:00+01:00","end":"2022-07-15T16:50:00+01:00"}],"type":"timeslot"},{"time":1015,"duration":30,"sessions":[{"id":"7C9GUJ","title":"Closing Session","duration":30,"abstract":"Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session\r\nClosing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session\r\nClosing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session Closing Session","day":"2022-07-15","time":1015,"endTime":1045,"audience":"intermediate","rooms":["The Auditorium"],"slug":"closing-session","type":"","speakers":[],"start":"2022-07-15T16:55:00+01:00","end":"2022-07-15T17:25:00+01:00"}],"type":"timeslot"}],"rooms":["The Auditorium","Wicklow Hall 1","Liffey A","Liffey B","Liffey Hall 1","Liffey Hall 2","Forum"]},"days":[{"day":"2022-07-11","type":"Tutorials"},{"day":"2022-07-12","type":"Tutorials"},{"day":"2022-07-13","type":"Talks"},{"day":"2022-07-14","type":"Talks"},{"day":"2022-07-15","type":"Talks"}]},"__N_SSG":true}