{"pageProps":{"path":"/speaker/dr-patrick-kavanagh","speaker":{"code":"EKYUCH","name":"Dr. Patrick Kavanagh","biography":"Dr. Patrick Kavanagh is an astrophysicist and software developer based at the Dublin Institute for Advanced Studies (DIAS). He is an expert in high-energy studies of supernova remnants, superbubbles and the hot interstellar medium.\r\n\r\nSince moving to DIAS he has worked on the development of calibration and software tools for the Mid-Infrared Instrument (MIRI) on Webb. MIRI is an international project comprising a consortium of European partner institutes, including DIAS, the European Space Agency, and partners in the US.\r\n\r\nHe works on many aspects of MIRI including the calibration of the MIRI Medium Resolution Spectrometer, development of the MIRI simulator, MIRI commissioning activities and analysis tools, and will support MIRI commissioning at the Webb Mission Operations Center at the Space Telescope Science Institute in Baltimore.","avatar":null,"slug":"dr-patrick-kavanagh","affiliation":"Dublin Institute for Advanced Studies (DIAS)","homepage":null,"twitter":null,"bioSource":{"compiledSource":"var d=Object.defineProperty,l=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var p=(e,t,n)=>t in e?d(e,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):e[t]=n,a=(e,t)=>{for(var n in t||(t={}))s.call(t,n)&&p(e,n,t[n]);if(i)for(var n of i(t))r.call(t,n)&&p(e,n,t[n]);return e},u=(e,t)=>l(e,m(t));var c=(e,t)=>{var n={};for(var o in e)s.call(e,o)&&t.indexOf(o)<0&&(n[o]=e[o]);if(e!=null&&i)for(var o of i(e))t.indexOf(o)<0&&r.call(e,o)&&(n[o]=e[o]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var o=n,{components:e}=o,t=c(o,[\"components\"]);return mdx(MDXLayout,u(a(a({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Dr. Patrick Kavanagh is an astrophysicist and software developer based at the Dublin Institute for Advanced Studies (DIAS). He is an expert in high-energy studies of supernova remnants, superbubbles and the hot interstellar medium.\"),mdx(\"p\",null,\"Since moving to DIAS he has worked on the development of calibration and software tools for the Mid-Infrared Instrument (MIRI) on Webb. MIRI is an international project comprising a consortium of European partner institutes, including DIAS, the European Space Agency, and partners in the US.\"),mdx(\"p\",null,\"He works on many aspects of MIRI including the calibration of the MIRI Medium Resolution Spectrometer, development of the MIRI simulator, MIRI commissioning activities and analysis tools, and will support MIRI commissioning at the Webb Mission Operations Center at the Space Telescope Science Institute in Baltimore.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}}},"__N_SSG":true}