{"pageProps":{"path":"/speaker/john-gill","speaker":{"code":"SVGULC","name":"John Gill","biography":"I grew up in Yorkshire, UK and always had an interest in space.\r\n\r\nI was lucky enough to be taught by Colin Rourke, when studying mathematics at Warwick some 40 years ago.\r\n\r\nAfter graduating I worked with computers for all my career, using python and linux almost exclusively since 2000.\r\n\r\nThis included a period of many years living and working in Dublin, when I first discovered the python world.\r\n\r\nMy interest in space-time has been rekindled by Colin Rourke's work, after many years of assuming astronomy only had minor details to work out.\r\n\r\nI am now semi-retired, teaching skiing in the winter and do some python mentoring as well.\r\n\r\nI write code to help me explore the universe.","avatar":null,"slug":"john-gill","affiliation":"Retired part time ski instructor studying the universe at home","homepage":"https://github.com/swfiua/gotu","twitter":null,"bioSource":{"compiledSource":"var d=Object.defineProperty,l=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var p=(e,n,o)=>n in e?d(e,n,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[n]=o,a=(e,n)=>{for(var o in n||(n={}))r.call(n,o)&&p(e,o,n[o]);if(i)for(var o of i(n))s.call(n,o)&&p(e,o,n[o]);return e},u=(e,n)=>l(e,m(n));var y=(e,n)=>{var o={};for(var t in e)r.call(e,t)&&n.indexOf(t)<0&&(o[t]=e[t]);if(e!=null&&i)for(var t of i(e))n.indexOf(t)<0&&s.call(e,t)&&(o[t]=e[t]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var t=o,{components:e}=t,n=y(t,[\"components\"]);return mdx(MDXLayout,u(a(a({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"I grew up in Yorkshire, UK and always had an interest in space.\"),mdx(\"p\",null,\"I was lucky enough to be taught by Colin Rourke, when studying mathematics at Warwick some 40 years ago.\"),mdx(\"p\",null,\"After graduating I worked with computers for all my career, using python and linux almost exclusively since 2000.\"),mdx(\"p\",null,\"This included a period of many years living and working in Dublin, when I first discovered the python world.\"),mdx(\"p\",null,\"My interest in space-time has been rekindled by Colin Rourke's work, after many years of assuming astronomy only had minor details to work out.\"),mdx(\"p\",null,\"I am now semi-retired, teaching skiing in the winter and do some python mentoring as well.\"),mdx(\"p\",null,\"I write code to help me explore the universe.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"homepageUrl":"https://github.com/swfiua/gotu"}},"__N_SSG":true}