{"pageProps":{"path":"/speaker/keith-quille","speaker":{"code":"DUNTUQ","name":"Keith Quille","biography":"I am a Senior Lecturer of computing in the School of Enterprise Computing and Digital Transformation in TU Dublin. My primary area of research is in Computer Science Education (with an emphasis on inclusion) which spans third, second and primary level’s. The main focus of my research at third level (including my PhD) was the early identification of students who were at risk of failing or dropping out of Computer Science (using machine learning techniques), as well as interventions to try and reduce attrition rates. My research also focuses on gender and inclusion, with an aim to reduce stereotypes and promote the Computer Science discipline across all levels of education. I am the co-chair of the ACM ITiCSE conference for 2022. My primary area of teaching is in Software Development, (CS1 and CS2: C#, Java and Python) and Applied Machine Learning with Artificial Intelligence. To complement my Computer Science Education research at third level, I have also been significantly involved at primary and second level Computer Science Education, from Governmental level with commissioned research, to co-authoring the leaving certificate book, to formal and informal teacher professional development, to leading a large scale national, primary and second level Computer Science outreach and research programme (http://CSinc.ie). I am also a member of the EU Commission expert group on AI and data in education and training.","avatar":"https://program.europython.eu/media/avatars/KeithQuille_Lhqkjlv.jpg","slug":"keith-quille","affiliation":null,"homepage":null,"twitter":null,"bioSource":{"compiledSource":"var p=Object.defineProperty,d=Object.defineProperties;var h=Object.getOwnPropertyDescriptors;var o=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,c=Object.prototype.propertyIsEnumerable;var s=(e,n,a)=>n in e?p(e,n,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[n]=a,t=(e,n)=>{for(var a in n||(n={}))r.call(n,a)&&s(e,a,n[a]);if(o)for(var a of o(n))c.call(n,a)&&s(e,a,n[a]);return e},l=(e,n)=>d(e,h(n));var m=(e,n)=>{var a={};for(var i in e)r.call(e,i)&&n.indexOf(i)<0&&(a[i]=e[i]);if(e!=null&&o)for(var i of o(e))n.indexOf(i)<0&&c.call(e,i)&&(a[i]=e[i]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var i=a,{components:e}=i,n=m(i,[\"components\"]);return mdx(MDXLayout,l(t(t({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"I am a Senior Lecturer of computing in the School of Enterprise Computing and Digital Transformation in TU Dublin. My primary area of research is in Computer Science Education (with an emphasis on inclusion) which spans third, second and primary level\\u2019s. The main focus of my research at third level (including my PhD) was the early identification of students who were at risk of failing or dropping out of Computer Science (using machine learning techniques), as well as interventions to try and reduce attrition rates. My research also focuses on gender and inclusion, with an aim to reduce stereotypes and promote the Computer Science discipline across all levels of education. I am the co-chair of the ACM ITiCSE conference for 2022. My primary area of teaching is in Software Development, (CS1 and CS2: C#, Java and Python) and Applied Machine Learning with Artificial Intelligence. To complement my Computer Science Education research at third level, I have also been significantly involved at primary and second level Computer Science Education, from Governmental level with commissioned research, to co-authoring the leaving certificate book, to formal and informal teacher professional development, to leading a large scale national, primary and second level Computer Science outreach and research programme (\",mdx(\"a\",t({parentName:\"p\"},{href:\"http://CSinc.ie\"}),\"http://CSinc.ie\"),\"). I am also a member of the EU Commission expert group on AI and data in education and training.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}}},"__N_SSG":true}