{"pageProps":{"path":"/speaker/niall-o-connor","speaker":{"code":"K379P3","name":"Niall O'Connor","biography":"Niall started coding on a sord m5 in 1984, love coding.  Started playing music in 1986, love performing. Started working in a bank in 2012, love trading.  Started gardening in 2017, love gardening.  Started noticing cycles in the markets, similar to the gardening and the seasons.  Started investigating supply chains and trends.  Realized coding and markets and gardening all related.  Discovered harmonic and fibonacci based patterns in the trends, just like music.  Realized my entire life was one gigantic intertwined blob of stuff.  Realized everyone else life is more or less the same.  Chilled out and condensed it all into a 30 minute talk.","avatar":null,"slug":"niall-o-connor","affiliation":"Bank Of America","homepage":"nialloconnor.info","twitter":"@ZechsMarquie","bioSource":{"compiledSource":"var c=Object.defineProperty,m=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,d=Object.prototype.propertyIsEnumerable;var s=(e,n,t)=>n in e?c(e,n,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[n]=t,o=(e,n)=>{for(var t in n||(n={}))r.call(n,t)&&s(e,t,n[t]);if(a)for(var t of a(n))d.call(n,t)&&s(e,t,n[t]);return e},l=(e,n)=>m(e,u(n));var g=(e,n)=>{var t={};for(var i in e)r.call(e,i)&&n.indexOf(i)<0&&(t[i]=e[i]);if(e!=null&&a)for(var i of a(e))n.indexOf(i)<0&&d.call(e,i)&&(t[i]=e[i]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var i=t,{components:e}=i,n=g(i,[\"components\"]);return mdx(MDXLayout,l(o(o({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Niall started coding on a sord m5 in 1984, love coding.  Started playing music in 1986, love performing. Started working in a bank in 2012, love trading.  Started gardening in 2017, love gardening.  Started noticing cycles in the markets, similar to the gardening and the seasons.  Started investigating supply chains and trends.  Realized coding and markets and gardening all related.  Discovered harmonic and fibonacci based patterns in the trends, just like music.  Realized my entire life was one gigantic intertwined blob of stuff.  Realized everyone else life is more or less the same.  Chilled out and condensed it all into a 30 minute talk.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"homepageUrl":"https://nialloconnor.info"}},"__N_SSG":true}