{"pageProps":{"source":{"compiledSource":"var c=Object.defineProperty,u=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var o=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(a,t,n)=>t in a?c(a,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):a[t]=n,e=(a,t)=>{for(var n in t||(t={}))o.call(t,n)&&s(a,n,t[n]);if(r)for(var n of r(t))l.call(t,n)&&s(a,n,t[n]);return a},p=(a,t)=>u(a,d(t));var m=(a,t)=>{var n={};for(var i in a)o.call(a,i)&&t.indexOf(i)<0&&(n[i]=a[i]);if(a!=null&&r)for(var i of r(a))t.indexOf(i)<0&&l.call(a,i)&&(n[i]=a[i]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var i=n,{components:a}=i,t=m(i,[\"components\"]);return mdx(MDXLayout,p(e(e({},layoutProps),t),{components:a,mdxType:\"MDXLayout\"}),mdx(\"article\",e({},{className:\"accent-left\"}),mdx(\"h2\",e({parentName:\"article\"},{className:\"highlighted\",id:\"channable\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#channable\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://www.channable.com/\"}),\"Channable\"))),mdx(\"p\",{parentName:\"article\"},`Channable is the ultimate solution for automating feed management and PPC ads.\nThe online-based feed management tool is powerful enough to create, optimize, and export your feeds to over 2500 comparison websites, affiliate platforms, and marketplaces including Amazon, eBay, bol.com, and more.\nChannable's PPC tool allows businesses to easily automate Google Ads (Google AdWords) and Microsoft Advertising (Bing Ads) with rules and dynamic variable fields, for ultimate quality scores and performance.\nIn a nutshell; Channable is simple, quick, and effective, and gives companies full control over their eCommerce strategy.`),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"channable-integrations-engineer\"},\"Integrations Engineer (Python)\")),mdx(\"p\",{parentName:\"article\"},\"  Looking for a position where you can both write code and help our customers? Then you may want to read further! In this role, you are part of our Integrations team. The Integrations team is the bridge between our customer-facing teams (e.g. Support & Sales) and the actual code of the tool Channable. We translate our clients\\u2019 needs into functionality, and we translate technical solutions to the language our clients understand.\"),mdx(\"p\",{parentName:\"article\"},\"  More specifically you will:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Be an accessible point of expertise within Channable on how our features work in the back-end\"),mdx(\"li\",{parentName:\"ul\"},\"Solve bugs and other technical issues that are reported by the Support & Customer Success departments\"),mdx(\"li\",{parentName:\"ul\"},\"Improve our tool\\u2019s existing functionalities to decrease the amount of technical issues in general\"),mdx(\"li\",{parentName:\"ul\"},\"Implement feature requests for specific parts of our tool\"),mdx(\"li\",{parentName:\"ul\"},\"Join calls with high-end clients & third party partners (e.g. Facebook) as the technical point of contact\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.channable.com/o/integrations-engineer-python-3\"}),\"Apply here\"),\" or contact Gio, our Tech Recruiter: \",mdx(\"a\",e({parentName:\"p\"},{href:\"mailto:giordano.tuvo@channable.com\"}),\"giordano.tuvo@channable.com\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"channable-python-software-engineer\"},\"Python Software Engineer\")),mdx(\"p\",{parentName:\"article\"},\"  In this position, you will be part of our diverse product team, that works on our main web application. The Product team is mainly responsible for our Python3 backend, which powers our API and serves as the main entry point for our services. You will be working on our API integrations, ads services, our export channels, new user-facing features, and our background jobs through which we process hundreds of millions of products per day. The Product team is working closely together with our Infrastructure and DevOps teams, which are developing many other services that power Channable under the hood, and all together we build our powerful tool!\"),mdx(\"p\",{parentName:\"article\"},\"  More specifically you will:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Contribute to our Python components and support new API\\u2019s\"),mdx(\"li\",{parentName:\"ul\"},\"Design, develop, and test new product features\"),mdx(\"li\",{parentName:\"ul\"},\"Collaborate with and review PRs of other team members\"),mdx(\"li\",{parentName:\"ul\"},\"Improve the reliability and robustness of our application\"),mdx(\"li\",{parentName:\"ul\"},\"Work on scalability and performance improvements\"),mdx(\"li\",{parentName:\"ul\"},\"Work together with the sales and support teams on requirements and issues\"),mdx(\"li\",{parentName:\"ul\"},\"Collaborate with the Integrations department about technical matters\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.channable.com/o/python-software-engineer-5\"}),\"Apply here\"),\" or contact Gio, our Tech Recruiter: \",mdx(\"a\",e({parentName:\"p\"},{href:\"mailto:giordano.tuvo@channable.com\"}),\"giordano.tuvo@channable.com\"))),mdx(\"article\",e({},{className:\"accent-right\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"hudson-river-trading\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#hudson-river-trading\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://www.hudsonrivertrading.com/\"}),\"Hudson River Trading\"))),mdx(\"p\",{parentName:\"article\"},\"At HRT we are mathematicians, computer scientists, statisticians, physicists, and engineers. We research and develop automated trading algorithms using advanced mathematical techniques.\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"hudson-ops-python-dev\"},\"Operations Python Developer\")),mdx(\"p\",{parentName:\"article\"},\"Hudson River Trading\\u2019s Operations team is responsible for managing the entirety of our live, production trading environment. This team plays an important role, acting as the glue that combines the work of multiple departments across HRT, to make our trading a reality. Python Developers on the Ops team work on automation and development projects that touch every part of the trade lifecycle. No trading knowledge is needed for this role - just strong technical skills and interest in working in Python!\")),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.hudsonrivertrading.com/careers/job/?q=operations+p&gh_jid=3044124&req_id=5c9e144f1us\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"hudson-systems-software-engineer\"},\"Systems Software Engineer\")),mdx(\"p\",{parentName:\"article\"},`The Systems Development team builds and maintains the platform of infrastructure and software that is shared by all Systems teams to provision, monitor, and manage our servers and networks. As a systems software engineer, your main focus will be on tool development in Python. You\\u2019ll be improving and integrating our existing tools and libraries across the platform as well as designing and building new ones to make our trading, research, installation, and monitoring systems easier to manage and more reliable. Strong Python skills and development experience are required, along with general Unix experience. As a member of our team, you\\u2019ll get the unique opportunity to have a significant impact on a critical part of our existing and growing infrastructure.\nAlgo Software Engineer`)),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.hudsonrivertrading.com/careers/job/?gh_jid=231624&req_id=5c9e144f1us\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"hudson-algo-software-engineer\"},\"Algo Software Engineer\")),mdx(\"p\",{parentName:\"article\"},\"Algo Software Engineers (AE) are programmers that focus on the software that powers trading and research. We work very closely with Researchers and Quant Traders and are responsible for making their research tools and trading platform powerful, flexible, fast, and easy to use. Because of this close collaboration, AEs tend to be the type of engineers that thrive on constant interaction and discussion. Hearing how their most recently deployed system allowed for whole new types of research would make their week. AEs are the type of engineers that don\\u2019t mind juggling a few projects at once and have a varied portfolio of project types, from long-term ambitious new systems to fire-fighting live issues.\")),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.hudsonrivertrading.com/careers/job/?gh_jid=75806&req_id=5c9e144f1us\"}),\"Apply here\"))),mdx(\"article\",e({},{className:\"accent-left\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"rapidratings-ireland\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#rapidratings-ireland\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://www.rapidratings.com\"}),\"RapidRatings Ireland\"))),mdx(\"p\",{parentName:\"article\"},\"RapidRatings is a boutique fintech company and is transforming the way the world\\u2019s leading companies manage supply chain and third-party risk by providing the most sophisticated analysis of the financial health of public and private companies in the world. We provide predictive analytics and powerful technology that provides deep insight into company\\u2019s financial health.\"),mdx(\"p\",{parentName:\"article\"},\"Here at RapidRatings we foster an environment where employees feel recognized for their contributions, appreciated for their individuality, and challenged to do their best. We know that bringing together employees with different backgrounds, perspectives, and experiences sparks innovation, promotes better decision making and yields the creative problem solving that\\u2019s critical to our long-term success. With us, you are not just a number \\u2013 we value people who are working hard and strive to make a real difference. Join our team to be a part of an industry-changing company and drive your career in the right direction.\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"rr-backend-software-engineer\"},\"Backend Software Engineer\")),\"What background should you bring?\",mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"coding experience and knowledge of Python, experience with Django or Flask.\"),mdx(\"li\",{parentName:\"ul\"},\"comfortable navigating databases and experience with SQL.\"),mdx(\"li\",{parentName:\"ul\"},\"proficient with HTTP and socket services, REST and RPC APIS, OpenAPI as well as continuous Integration and testing (Jenkins).\"),mdx(\"li\",{parentName:\"ul\"},\"experience with AWS services (Lambda, EKS, ECR) or Containerisation (Docker, Kubernetes).\")),mdx(\"p\",{parentName:\"article\"},\"  We currently have 10+ full time job positions (experienced and junior) available in Ireland (hybrid or remote)\")),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://rapidratings.bamboohr.com/jobs/view.php?id=128\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"rr-frontend-software-engineer\"},\"Frontend/UI Engineer\")),\"What background should you bring?\",mdx(\"p\",{parentName:\"article\"},\"  Knowledge in HTML5, CSS and Javascript are a must as that\\u2019s where you\\u2019ll be spending most of your time - and especially in the context of Adaptive & Responsive design. We're looking for a person with an appetite for learning, and the following core skillset:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"JavaScript ECMAScript 2018\"),mdx(\"li\",{parentName:\"ul\"},\"ReactJS\"),mdx(\"li\",{parentName:\"ul\"},\"Utility first CSS frameworks (Tailwind CSS)\"),mdx(\"li\",{parentName:\"ul\"},\"Webpack, Github Actions\"),mdx(\"li\",{parentName:\"ul\"},\"Data visualisation (preferably with D3)\"),mdx(\"li\",{parentName:\"ul\"},\"Unit testing (preferably with testing-library) and E2E testing (preferably with Cypress)\"),mdx(\"li\",{parentName:\"ul\"},\"Working experience in cross-browser and W3C accessibility standards\"),mdx(\"li\",{parentName:\"ul\"},\"Working in Agile environment\")),mdx(\"p\",{parentName:\"article\"},\"We currently have 2 full time job positions available in Ireland (hybrid or remote)\")),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://rapidratings.bamboohr.com/jobs/view.php?id=184\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"rr-data-engineer\"},\"Data Engineer\")),\"What background\\u202Fshould you bring?\\u202F\",mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Programming, systems integration, and Data Warehousing environments\\u202F\"),mdx(\"li\",{parentName:\"ul\"},\"Maintenance of systems, processes, code and pipelines for the processing of data from a range of sources and types\"),mdx(\"li\",{parentName:\"ul\"},\"ETL/DWH developer with strong knowledge in designing, developing and delivering end-to-end data integration processes for large scale data warehouses\"),mdx(\"li\",{parentName:\"ul\"},\"Deep Knowledge of SQL, data modelling and data warehousing concepts.\"),mdx(\"li\",{parentName:\"ul\"},\"Experience in data management frameworks; Data Quality Profiling, Metadata Management, Master Data Management, cleansing/standardising, and analysing.\\u202F\"),mdx(\"li\",{parentName:\"ul\"},\"Strong command of relevant programming/scripting languages: e.g., Python, R.\"),mdx(\"li\",{parentName:\"ul\"},\"Experience with and knowledge of data visualization tools e.g., Looker, QuickSight, Yellowfin, Pyramid\")),mdx(\"p\",{parentName:\"article\"},\"We currently have 1 full time job positions available in Ireland (hybrid or remote)\")),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://rapidratings.bamboohr.com/jobs/view.php?id=188\"}),\"Apply here\"))),mdx(\"article\",e({},{className:\"accent-right\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"ebury\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#ebury\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://ebury.com/\"}),\"Ebury\"))),mdx(\"p\",{parentName:\"article\"},`Ebury is a Global FinTech company specialized in international payments, collections, and foreign exchange services. We apply new technologies to enhance and automate financial\nservices and processes. This allows small and medium-sized businesses to trade and transact internationally by eliminating boundaries related to more traditional procedures.\nFounded in London in 2009, the company has grown its global market presence to a network of 30 offices in 20 countries and more than 1,200 employees.\nYou will contribute to the development of a transactional banking platform, focusing on receiving and issuing payments in more than 140 currencies.\nOur platform is a single platform (20+ Services) with 3 distinct channels for users to access our core functionality:`),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Salesforce.com for our front office staff\"),mdx(\"li\",{parentName:\"ul\"},\"Online banking portal build with Vue.js and A Rest API for 3rd party integrations.\"),mdx(\"li\",{parentName:\"ul\"},\"We build and run services in production using tools such as Jenkins, Terraform, Sentry, Prometheus, ELK. All of these run smoothly in Docker containers on AWS ECS and Kubernetes. You will work with cross-functional product and technology teams across the company to build new features at large and multi-region scale.\")),mdx(\"p\",{parentName:\"article\"},\"If you join Ebury you may count with:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Being part of a remote-first distributed technology team having flexibility, better work-life balance and wellbeing.\"),mdx(\"li\",{parentName:\"ul\"},\"Working with enthusiastic, innovative, multinational and collaborative teams, always ready to disrupt and revolutionize the fast-paced FinTech sector!\"),mdx(\"li\",{parentName:\"ul\"},\"Clear career progression path and continued personal development through training and certifications.\"),mdx(\"li\",{parentName:\"ul\"},\"Participation in the events of your field of expertise covered by the company.\"),mdx(\"li\",{parentName:\"ul\"},\"Paid vacation even if you are a contractor.\"),mdx(\"li\",{parentName:\"ul\"},\"Annual bonus based on your performance.\"),mdx(\"li\",{parentName:\"ul\"},\"Team meetings once per year in one of our locations - last time it was in Malaga, Spain.\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"ebury-senior-python-dev\"},\"Senior Python Developer - 100% Remote\")),\"We are looking for team players that:\",mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Have extensive (+5 years) experience in developing complex software systems - we work with Python/Django;\"),mdx(\"li\",{parentName:\"ul\"},\"Can \\u201Cbuild and run\\u201D services and are comfortable with dockerizing code, defining standard REST endpoints, adding monitoring and alerting services\"),mdx(\"li\",{parentName:\"ul\"},\"Are writing testable and well covered with unit and integration tests code - we use Jenkins pipeline and Terraform for the deployment of services and infrastructure.\"),mdx(\"li\",{parentName:\"ul\"},\"Are comfortable using English language on daily bases both written and spoken\")),mdx(\"p\",{parentName:\"article\"},\"Nice to have:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Experience in developing systems for Mobile Apps Backend Environments.\"),mdx(\"li\",{parentName:\"ul\"},\"SQL knowledge.\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.ebury.com/jobs?department=IT+%26+Technology&query=\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"ebury-mobile-dev\"},\"Mobile Apps Backend Developer - 100% Remote\")),mdx(\"p\",{parentName:\"article\"},\"  You'll love to work with us if:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"You have experience in developing complex software systems for Mobile Apps Backend Environments. We mainly work with Python, but it is also ok if you are more comfortable with other languages - like Node.js or Go.\"),mdx(\"li\",{parentName:\"ul\"},\"You like to be a support for all the mobile backend as a service. Analytics, notifications, storage frameworks such as Firebase, Amplify, or similar.\"),mdx(\"li\",{parentName:\"ul\"},\"You want to \\u201Cbuild and run\\u201D services. Therefore, you will be comfortable with dockerizing your code, defining standard REST endpoints, adding monitoring, and alerting for your services.\"),mdx(\"li\",{parentName:\"ul\"},\"K8s knowledge is a plus\"),mdx(\"li\",{parentName:\"ul\"},\"You build your code to be testable and well covered with unit and integration tests.\"),mdx(\"li\",{parentName:\"ul\"},\"We use CI Jenkins pipelines and terraform for the deployment of services and infrastructure. From time to time, you might need to contribute to it.\"),mdx(\"li\",{parentName:\"ul\"},\"You are able to communicate clearly and concisely your ideas in English both written and spoken.\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.ebury.com/jobs?department=IT+%26+Technology&query=\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"ebury-senior-sre\"},\"Senior Site Reliability Engineer - 100% Remote\")),mdx(\"p\",{parentName:\"article\"},`You will be joining our SRE team to focus on site reliability of our Finance and Foreign\nExchange platform, specifically looking to further decouple our application deployment and\ninfrastructure.`),mdx(\"p\",{parentName:\"article\"},`We are mainly in AWS, and we are actively migrating to EKS and implementing Kafka.\nCandidate required skills:`),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"Several years of relevant industry experience building large scale distributed systems.\"),mdx(\"li\",{parentName:\"ul\"},\"Experience operating web-scale deployments of containerised systems on Kubernetes and Amazon or Google Container Services.\"),mdx(\"li\",{parentName:\"ul\"},\"A deep understanding of programming languages and the systems you've worked on.\"),mdx(\"li\",{parentName:\"ul\"},\"A passion for architecting large systems with elegant interfaces that can scale easily\"),mdx(\"li\",{parentName:\"ul\"},\"A hunger for tracking down root causes, no matter where it takes you and fixing them in systematic ways. Working with code owners to prevent repeats.\"),mdx(\"li\",{parentName:\"ul\"},\"A love for writing code - we use Python; you don\\u2019t need to be an expert, but the experience is a plus and we will expect you to learn on the job.\"),mdx(\"li\",{parentName:\"ul\"},\"Excellent written and interpersonal communication skills and willingness to uphold Eburys values.\"),mdx(\"li\",{parentName:\"ul\"},\"Our operating language is English but a knowledge of Spanish or Portuguese is a bonus.\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.ebury.com/jobs?department=IT+%26+Technology&query=\"}),\"Apply here\"))),mdx(\"article\",e({},{className:\"accent-left\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"numberly\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#numberly\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://numberly.com/\"}),\"Numberly\"))),mdx(\"p\",{parentName:\"article\"},\"Numberly helps its customers collect, analyze and leverage their data across all marketing channels.\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"numberly-sw-engineer-dev-ops\"},\"Software Engineer / DevOps\")),\"Due to our wide range of interconnected products,  our technical issues are very varied and often complex: - processing thousands of queries per second, distributed throughout the world. - operate multiple petabyte databases (Big Data\\u2122) - automate our entire bare-metal infrastructure - build tomorrow's digital marketing interfaces.\",mdx(\"p\",{parentName:\"article\"},\"  To do this, we want to use the right technologies for the right issues:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Python 3 for our web services, our data engineering, and the automation of our infrastructure.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"MongoDB and PostgreSQL for their versatility in the use of the data\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"ScyllaDB when it comes to performance\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"GitLab and Kubernetes to provide the best possible development experience but also Kafka, Redis, Elasticsearch, Go, and many others...\"),mdx(\"p\",{parentName:\"li\"},\"Qualifications\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Strong IT culture and technical curiosity\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Thorough knowledge in at least one back-end stack\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Interest in databases, the world of open-source, and/or DevOps culture\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Good communicator, able to popularize work, defend ideas and listen to others\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Willingness to progress and to help others progress, technically (meetups, internal training) and humanly\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Good experience using Python and/or Javascript is a plus\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Daily use of Linux is very preferable but not required\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Professional English (our teams are international)\"),mdx(\"p\",{parentName:\"li\"},\"Additional Information\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"At Numberly, we share a passion for transmission: weekly seminars, talks with professionals who are experts in their field, permanent learning.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"A fast and powerful onboarding, thanks in particular to:\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Jedi Masters given to new recruits;\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Live my life in different teams;\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Happy Meetings attended by all the teams in the world to share the group's news.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"We cultivate the freedom of speech that allows everyone to participate in the group's influence. Through 1000mercis impacts but also through our activities that create value in the open - Internet, we have a positive impact on our ecosystem.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Numberly is Gender Equal by design (gender equality index of 97/100 in 2020, WeConnect International certification).\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Numberly is an international environment (you interact with many nationalities on a daily basis) where you feel at home: warm offices, friendly kitchens, a precise library, space for bicycles. - Coffee and tea at your disposal. Mystery lunches, fancy dress parties and sports classes.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Remote work possible.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Swile card (meal vouchers).\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Numberly welcomes candidates with disabilities.\")))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.smartrecruiters.com/numberly/743999812880549\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"numberly-data-scientist\"},\"Data Scientist\")),mdx(\"p\",{parentName:\"article\"},`  We are looking for a data scientist to work on innovative projects in the field of digital marketing.\nYour job will be to help our team optimize Digital Marketing campaigns using Applied Mathematics and Machine Learning. You will join the data science and analysis team, composed of data scientists, data analysts and a machine learning engineer, where you will be designing new algorithms using your knowledge and analytical skills in order to take on new business challenges.`),mdx(\"p\",{parentName:\"article\"},\"  Position summary:\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You will take part in the elaboration, optimization and development of machine-learning algorithms, to improve the efficiency of Numberly\\u2019s Relationship Marketing Programs (examples of projects we are currently working on include: scoring of users with their probability of purchase, ranking inventories according to their predicted performance, product recommendation - algorithm, reinforcement learning applied to banner selection ...)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You will have the ownership of the new algorithms you build, from understanding and assessing the business need to the modelisation (based on literature reviews) and finally the implementation in production with the help of our data engineers and machine learning engineer.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You will work closely with marketing teams, project managers, data engineers and machine learning engineers and developers\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You will help improve existing algorithms, add new features and adapt them to a complex and always changing environment\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You will have access to large datasets to build supervised or unsupervised algorithms:\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},`behavioral and declarative data collected in real time\nthousands of socio-demographic variables on millions of individuals\ntransactional data collected by our clients`),mdx(\"p\",{parentName:\"li\"},\"Qualifications\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Master's degree required in a quantitative field such as Machine learning, Statistics or Applied Mathematics\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Machine learning algorithms knowledge (both supervised and unsupervised) is required\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Coding skills in an object oriented language is required (Python prefered, Java, Scala \\u2026)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"SQL knowledge will be strongly appreciated\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Knowledge or experience in Spark and airflow is a plus\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Highly motivated, intellectually curious, strongly interested in the digital industry\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Start-up spirit, capable at multitasking and prioritizing workload\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Excellent communication skills, strong motivation to work in a fast growing company in an international environment\"),mdx(\"p\",{parentName:\"li\"},\"Technical environment in Numberly:\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Hadoop ecosystem  (HDFS, Hive ... )\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Apache Spark\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Apache Airflow\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"SQL Databases (Postgres, SQLServer)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"NoSQL databases (MongoDB, ScyllaDB, ElasticSearch, ...) and graph database (Neo4j)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Apache Kafka\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Python, Java, Scala\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Git, Linux\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Docker, Kubernetes\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"FastAPI\"),mdx(\"p\",{parentName:\"li\"},\"Additional Information\"),mdx(\"p\",{parentName:\"li\"},`At Numberly, we share a passion for transmission: weekly seminars, talks with professionals who are experts in their field, permanent learning.\nA fast and powerful onboarding, thanks in particular to :`)),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Jedi Masters given to new recruits;\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Live my life in different teams;\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Happy Meetings attended by all the teams in the world to share the group's news.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"We cultivate the freedom of speech that allows everyone to participate in the group's influence. Through 1000mercis impacts but also through our activities that create value in the open Internet, we have a positive impact on our ecosystem.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Numberly is Gender Equal by design (gender equality index of 97/100 in 2020, WeConnect International certification).\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Numberly is an international environment (you interact with many nationalities on a daily basis) where you feel at home: warm offices, friendly kitchens, a precise library, space for bicycles.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Coffee and tea at your disposal. Mystery lunches, fancy dress parties and sports classes.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Remote work possible.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Swile card (meal vouchers).\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Numberly welcomes candidates with disabilities.\")))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.smartrecruiters.com/numberly/743999826685826\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"numberly-data-engineer\"},\"Data Engineer / DataOps\")),\"Numberly is looking for a Data Engineer to join its dedicated team Data. As a BI and Data Engineer you will: - Create and maintain pipeline jobs that transfer client data to/from our database diverse infrastructure (Hive, MS SQL Server, MongoDB, ScyllaDB). - Participate in a huge migration from CRM to CDP (SQL Server to hadoop, relational DB to NoSQL) - Nurture our large Hadoop cluster, optimize distributed Data Operations and Storage. - Participate in decision making concerning efficient & ethical use of data and technological evolution at Numberly. - Work alongside Data Analytics, Data Scientists, DevOps, and many other talented techs. - Suggest your own technological solutions and try them out (our latest POCs include Apache Druid and Tabular) . - Join a great multicultural team filled with wonderful people\",mdx(\"p\",{parentName:\"article\"},\"  Qualifications\"),mdx(\"p\",{parentName:\"article\"},\"  You :\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Like data in all its forms: raw, reworked, refined, calculated, analyzed, reused\\u2026\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Like work well done and pay attention to detail\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Dream of being able to develop and manage website databases with strong traffic\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Want to work with various, prestigious clients on different problems\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Are on the lookout for new languages/technologies and test the latest open source trends before others\"),mdx(\"p\",{parentName:\"li\"},\"You love the following stack?\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Hadoop ecosystem  (HDFS, Hive, Impala, HBase, ...)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"SQL Databases (MySQL, SQLServer)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Apache Spark\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"ETL (Apache Airflow or equivalent)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"NoSQL databases (MongoDB, ScyllaDB, ElasticSearch, ...)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Apache Kafka\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Python, Java, Scala\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Git\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Linux\"),mdx(\"p\",{parentName:\"li\"},\"Even better if you know :\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Cube OLAP and SSRS\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Cloud Solutions (AWS, GCP, \\u2026)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"API REST, WebServices\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Docker\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Kubernetes\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Apache Druid\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Data Science and Machine Learning\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Message Queuing (RabbitMQ, Celery, \\u2026)\"),mdx(\"p\",{parentName:\"li\"},\"Additional Information\"),mdx(\"p\",{parentName:\"li\"},\"At Numberly, we share a passion for transmission: weekly seminars, talks with professionals who are experts in their field, permanent learning.\"),mdx(\"p\",{parentName:\"li\"},\"A fast and powerful onboarding, thanks in particular to:\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Jedi Masters given to new recruits;\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Live my life in different teams;\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},`Happy Meetings attended by all the teams in the world to share the group's news.\nWe cultivate the freedom of speech that allows everyone to participate in the group's influence. Through 1000mercis impacts but also through our activities that create value in the open - Internet, we have a positive impact on our ecosystem.`)),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},`Numberly is Gender Equal by design (gender equality index of 97/100 in 2020, WeConnect International certification).\nNumberly is an international environment (you interact with many nationalities on a daily basis) where you feel at home: warm offices, friendly kitchens, a precise library, space for bicycles. - Coffee and tea at your disposal. Mystery lunches, fancy dress parties and sports classes.`)),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Remote work possible.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Swile card (meal vouchers).\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Numberly welcomes candidates with disabilities.\")))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.smartrecruiters.com/numberly/743999812873647\"}),\"Apply here\"))),mdx(\"article\",e({},{className:\"accent-right\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"oomnitza\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#oomnitza\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://www.oomnitza.com/\"}),\"Oomnitza\"))),mdx(\"p\",{parentName:\"article\"},\"Oomnitza is a Silicon Valley-based SaaS Enterprise Technology Management solution that provides a key business process system for endpoints, applications, infrastructure, and networking. It automates the lifecycle processes, from purchase to end of life, ensuring your technology is secure, compliant, and optimized.\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"Oomnitza-full-stack-engineer\"},\"Senior Full Stack Software Engineer (Ireland Remote)\")),mdx(\"p\",{parentName:\"article\"},\"  Team Oomnitza is looking for an experienced and driven Senior Full Stack Engineer to work on the next generation of SaaS enterprise software.\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have a passion for simple, elegant design and shipping quality product.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You enjoy collaborating and communicating within a rapidly growing, ambitious team.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have a strong focus on the user with empathy for their challenges and are excited to help build an infrastructure that delivers a positive experience for customers of any size.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have a strong sense of accountability and thrive in a dynamic team environment.\"),mdx(\"p\",{parentName:\"li\"},\"We are looking for analytical people who want to solve interesting and complex technological problems and are excited to grow with us as we scale.\")))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.lever.co/oomnitza/0832e416-75a4-4bf8-9f9f-9b56fca48a07\"}),\"Apply here\"),\" or contact Nicole \",mdx(\"a\",e({parentName:\"p\"},{href:\"mailto:nicole.maxwell@oomnitza.com\"}),\"nicole.maxwell@oomnitza.com\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"Oomnitza-qa-automation\"},\"QA Automation Engineer (Ireland Remote)\")),\"Team Oomnitza is looking for an experienced and driven quality assurance automation engineer to work on the next generation of SaaS enterprise software.\",mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"You will work with product and engineering teams to plan and develop automated test suites for the Oomnitza platform, use and develop new tools to effectively test and improve Oomnitza's - engineering processes, maintain and evaluate automated tests week to week and report problems you discover.\"),mdx(\"li\",{parentName:\"ul\"},\"You are excited about providing new tools to the QA team to make verification processes more efficient. You work with developers to make hard-to-test features more testable for QA.\"),mdx(\"li\",{parentName:\"ul\"},\"You understand the inner workings of technologies that you test.\"),mdx(\"li\",{parentName:\"ul\"},\"You know that it is the job of a Quality Assurance Engineer to speak up at any point in the process.\"),mdx(\"li\",{parentName:\"ul\"},\"You are someone with high standards who will push us to be better.\"),mdx(\"li\",{parentName:\"ul\"},\"You're someone who wants to see the impact of your work making a difference every day.\"),mdx(\"li\",{parentName:\"ul\"},\"You understand the role of Quality Assurance and you are a strong advocate for quality\"),mdx(\"li\",{parentName:\"ul\"},\"You are motivated to consider the user experience of the site for various types of users, test the edge cases of products, and lobby for having problems you've encountered get fixed.\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.lever.co/oomnitza/11ee5568-4ba2-43a9-95a1-0285e529d732\"}),\"Apply here\"),\" or contact Nicole \",mdx(\"a\",e({parentName:\"p\"},{href:\"mailto:nicole.maxwell@oomnitza.com\"}),\"nicole.maxwell@oomnitza.com\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"Oomnitza-eng-dev-manager\"},\"Engineering Development Manager (Ireland Remote)\")),\"Oomnitza are growing and we are seeking a passionate and driven Engineering Development Manager  who will play a key role in accelerating our growth plans in EMEA. As Engineering Development Manager you will lead a team (or teams) to deliver results that will impact Oomnitza\\u2019s  success.\",mdx(\"p\",{parentName:\"article\"},\"  The Engineering Development Manager adds value by leading and aligning the engineering team with Oomnitza\\u2019s vision.\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You care deeply about helping the people whom you manage grow into excellent engineers and great teammates.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You are interested in technical work, with enough experience to make sure that engineers are moving in the right direction.\"),mdx(\"p\",{parentName:\"li\"},\"On a given day, you might be reviewing design documents and PRs, coordinating discussions between teams, collaborating on roadmaps with architectural and product stakeholders, and conducting 1:1s with team members.\")))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://jobs.lever.co/oomnitza/7c670568-4478-43bd-94f6-d562ff6da505\"}),\"Apply here\"),\" or contact Nicole \",mdx(\"a\",e({parentName:\"p\"},{href:\"mailto:nicole.maxwell@oomnitza.com\"}),\"nicole.maxwell@oomnitza.com\"))),mdx(\"article\",e({},{className:\"accent-left\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"sendcloud\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#sendcloud\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://www.sendcloud.com/\"}),\"Sendcloud\"))),mdx(\"p\",{parentName:\"article\"},\"This is what you tell people at parties \\u{1F44B}\"),mdx(\"p\",{parentName:\"article\"},\"I work at one of the fastest-growing tech companies in Europe. We have a high-performing environment and we get rewarded for all of our wins. We even made it to the list of the Financial Times top 1000 fastest-growing companies. Together with Sendcloud, I am on a mission to empower businesses with world-class shipping. With more than 23,000 customers throughout Europe, and soon beyond, Sendcloud is the leading shipping solution in Europe.\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"sendcloud-backend-engineer\"},\"Backend Engineer\")),\"Who are we looking for? \\u{1F9D0} As a Python Developer, you will be working on the Sendcloud system. Sendcloud integrates various carriers and online stores in a fast and intuitive tool. We release early and often. The development team is responsible for building the Sendcloud system and keeping it running. Our code base has high test coverage, we apply continuous integration and we love to automate stuff to squeeze out manual steps in our process.\",mdx(\"p\",{parentName:\"article\"},`  Work on our product is split across 4 domains, each with 2 - 3 cross-functional feature teams, focusing on different parts of our platform:\nDomain Scaling: focused on integration and interaction with our clients\\u2019 e-commerce systems on one side, and support of Sendcloud\\u2019s internal teams like finance, operations, marketing, and customer support, on the other side.\nDomain Delivery Experience: focused on improving the end-user experience with the checkout process, tracking and tracing of shipped parcels, and handling returns.\nDomain Efficiency: deals with data generated through a shipping process and efficiently processing an order into shipment within the workflow.\nDomain Carierrland: responsible for interacting with logistics service providers in order to optimize the process of carrier integration.`),mdx(\"p\",{parentName:\"article\"},\"  Apart from the above-mentioned, we have a Platform domain whose focus is to handle deployments and operations of our software, making sure our production is secure and stable. In there, our shared services team is responsible for building the accounts and authentication system and a large number of shared libraries used for integration. Also, the API enablement team is responsible for the maintenance and configuration of the API developer portal as an offering towards feature teams.\"),mdx(\"p\",{parentName:\"article\"},`  Our perfect match\\u{1F497}\nAt least 3-5 years of working experience with Python and frameworks like FastAPI and Django. Other Python web frameworks experience is a plus.\nYou have extensive experience using and building REST API\\u2019s.\nYour code is always under test and version control (we use Git).\nYou know your way around Linux and how to work on the command-line.\nYou understand and design your code with observability in production in mind.\nYou have developed distributed and scalable code.\nYou have experience with at least one of the following technologies: Docker, AWS/Azure/GCP.\nGood written and oral communication skills in English.`),mdx(\"p\",{parentName:\"article\"},`  You share our core values;\n\\u{1F4A9} No bullshit: we don\\u2019t like big egos, we like honesty, transparency & openness. Share your mistakes with us and learn from them!\n\\u{1F3AF} Grow & Win: Keep on learning and improving, from each other, mistakes and by actively searching for ways to keep on developing your skills.\n\\u{1F3A0} Have fun: you are not afraid to be yourself and you love to be surrounded by your awesome colleagues!`),mdx(\"p\",{parentName:\"article\"},`  Nice to have:\nOur front-end is written in VueJS, so, front-end development experience is a big plus.\nA DevOps mindset and knowledge of Kubernetes, Istio, and Grafana are a big plus.`),mdx(\"p\",{parentName:\"article\"},`  Benefits\\u{1F389}\nWorking in an internationally oriented, fast-growing, certified Great Place to Work! \\u{1F4CC}\nA good salary that grows with the company and your accomplishments\nAfter 3 years of employment, you get a sabbatical of 4 weeks from us\nKeep growing with a study budget of \\u20AC2000,- per year!\nStay fit in our Sendcloud gym!\nPension scheme\nDiscount on a health insurance\nAccess to many different discount programs, shop til you drop! \\u{1F6D2}`),mdx(\"p\",{parentName:\"article\"},\"  This position is open to worldwide candidates.  We offer (in-house) relocation assistance, which will make sure that you have a smooth relocation process. \\u{1F3E0}\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},\"A relocation allowance of \\u20AC3.000 (net) to help you cover the costs of your move to the Netherlands.\"),mdx(\"li\",{parentName:\"ul\"},\"A flight ticket to the Netherlands for you (and your partner and children moving with you, if applicable);\"),mdx(\"li\",{parentName:\"ul\"},\"Transfer from the airport to your first accommodation\"),mdx(\"li\",{parentName:\"ul\"},\"We will help you out with your work VISA (and legal fees) and applying for the 30% ruling (if applicable).\"))),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"sendcloud-devops-engineer\"},\"DevOps engineer\")),mdx(\"p\",{parentName:\"article\"},\"  What you will do in this role \\u{1F9D0}\"),mdx(\"p\",{parentName:\"article\"},\"  As a DevOps engineer you will be working on the Sendcloud platform within the platform domain. Your work will be distributed between the requirements set by the development team, while still being able to contribute to the overall platform improvements. That platform is used by our software development teams to build, test, deploy and run software themselves. You will be responsible for onboarding development teams into the world of DevOps, and guide developers on the importance of inclusion of non-functional requirements (observability, operations, deployments, security, etc.), with how to define their CI/CD pipelines, and assist them with software development tooling.\"),mdx(\"p\",{parentName:\"article\"},\"  As a part of the DevOps team your goal is to make the product development teams fully independent and more productive with a self-service, scalable platform and related software development tooling. You will co-work with the software engineers from development teams, making sure they know how to use the platform, automate repeating tasks, and taking their feedback into account for further improvements.\"),mdx(\"p\",{parentName:\"article\"},\"  Our perfect match\\u{1F497}\"),mdx(\"ul\",{parentName:\"article\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have a background in development and/or operations.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have at least 3 years of experience in a similar DevOps role.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have experience with Linux, the command line doesn't scare you.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have experience with Amazon Web Services.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You swear by Infrastructure as Code (preferably with Terraform).\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have experience developing software yourself.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Knowledge of relational databases.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have strong experience with Kubernetes, Helm, and running production (micro)services.\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You have knowledge of Distributed systems, including containerized (micro)services and highly scalable web applications\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You know what it takes to build high-quality software on a professional basis\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You are eager to learn and keep improving yourself. You're up to date about the latest technologies and a passionate Engineer\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Good written and oral communication skills in English\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"You are a team player and you like to share your opinion and knowledge.\"),mdx(\"p\",{parentName:\"li\"},`Nice to have \\u{1F929}\nExperience with educating people.\nExperience with canary deployments.\nExperience with Datadog.\nYou share our core values;`),mdx(\"p\",{parentName:\"li\"},`\\u{1F4A9}  No bullshit: we don\\u2019t like big egos, we like honesty, transparency & openness. Share your mistakes with us and learn from them!\n\\u{1F3AF}  Grow & Win: Keep on learning and improving, from each other, mistakes and by actively searching for ways to keep on developing your skills\n\\u{1F3A0}  Have fun:you are not afraid to be yourself and you love to be surrounded by your awesome colleagues!\nBenefits\\u{1F389}`),mdx(\"p\",{parentName:\"li\"},`Working in an internationally oriented, fast-growing, certified Great Place to Work! \\u{1F4CC}\nA good salary that grows with the company and your accomplishments\nAfter 3 years of employment, you get a sabbatical of 4 weeks from us\nKeep growing with a study budget of \\u20AC2000,- per year!\nStay fit in our Sendcloud gym!\nPension scheme\nDiscount on a health insurance\nAccess to many different discount programs, shop til you drop! \\u{1F6CD}`)))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.sendcloud.com/jobs/\"}),\"Apply here\")),mdx(\"p\",{parentName:\"article\"},\"template\")),mdx(\"article\",e({},{className:\"accent-right\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"optum\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#optum\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://optum.co\"}),\"Optum\"))),mdx(\"p\",{parentName:\"article\"},\"Want to build a new future for healthcare?\"),mdx(\"p\",{parentName:\"article\"},\"It only takes one inspired idea to change the world. At Optum and UnitedHealth Group, the technology and innovation we invent is in service of a feature where healthcare serves everyone more fairly, productively and consistently. We work tirelessly to build solutions to create a healthier world, one idea at a time. \"),mdx(\"p\",{parentName:\"article\"},\"Across Optum we\\u2019re not just using technology and analytics to help millions receive care, we\\u2019re evolving it by understanding how that care is provided, paid for and, most importantly, how it helps improve health through greater outcomes. There are no limits here on the resources you\\u2019ll have or the challenges you\\u2019ll encounter. From the most advanced application development tools and methodologies to innovative approaches to AI and Data Science, we\\u2019re doing, sharing and learning new ways to make technology and healthcare work better. And with the largest and best store of healthcare related data in the world, this is challenge on an enormous scale with incredible potential.\"),mdx(\"p\",{parentName:\"article\"},\"We want to make health care work better for everyone. This depends on hiring the best and brightest. Explore our opportunities and career site today and begin your life\\u2019s best work\\u2120.\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"optum-data-eng\"},\"VP \\u2013 Software Engineering and Data Science\")),\"Reporting directly into the Chief Data Scientist of Optum Enterprise Data and Analytics, this Senior Leadership role will provide visionary direction to talented teams of innovators across our enterprise. \",mdx(\"p\",{parentName:\"article\"},\"  This is an opportunity to leverage your technology expertise and understanding of market trends, to formulate, develop and execute multi-year strategic technology plans to grow the business and deliver real value to our customers. And we\\u2019ll give you the partnership opportunities to get those incubated solutions into the right teams to continue the development post R&D.\")),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://optum.co/VPEngDataScience\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"optum-data-scientist\"},\"Senior Data Scientist (Hybrid)\")),\"As a Senior Data Scientist, you will be part of a team working at the intersection of financial services and health care to launch new cash flow solutions to drive broader, more equitable access to capital.\"),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://optum.co/SrDataScientist\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"optum-sr-sw-eng\"},\"Senior Principal Software Engineer, ML & AI (Hybrid)\")),\"Do you want to impact healthcare using Artificial Intelligence and Machine Learning at the largest healthcare company in the world?\",mdx(\"p\",{parentName:\"article\"},\"  If so, this is a chance to do just that. As a Senior Principal Software Engineer within the Advanced Technology Collaborative, you will work to achieve our goal of incubating and delivering technologies to improve the lives of millions of people.\")),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://optum.co/SnrPrincipalSoftware\"}),\"Apply here\"))),mdx(\"article\",e({},{className:\"accent-left\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"udemy\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#udemy\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://about.udemy.com/\"}),\"Udemy\"))),mdx(\"p\",{parentName:\"article\"},\"Udemy is the world\\u2019s largest education platform with more than 30 million monthly visitors. Through our Consumer and Enterprise businesses, Udemy creates new possibilities for people and organizations everywhere by connecting them to the knowledge and skills they need to succeed in a changing world. The Udemy consumer marketplace offers thousands of up-to-date courses in dozens of languages and provides the tools learners and instructors need to achieve their goals and reach their full potential.\"),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://about.udemy.com/jobs/4378188004/\"}),\"See open positions here\"))),mdx(\"article\",e({},{className:\"accent-right\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"bank-of-america\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#bank-of-america\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://careers.bankofamerica.com\"}),\"Bank of America\"))),mdx(\"p\",{parentName:\"article\"},`In Dublin we are always finding new ways to create a global impact by driving real, positive change through technical innovation.\nJoin us and you\\u2019ll have the chance to drive environmental, societal, and governmental change, set industry standards and benefit from a wide range of learning and development programmes.\nWe\\u2019re recruiting for a range of tech roles now. Discover careers at Bank of America today.`),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"bofa-full-stack\"},\"Full Stack Developer\")),\"Here in our Dublin office we are looking to recruit for a Full Stack Developer role within our Strategic Asset Liability Management Technology (SALMT) space. The team is responsible for delivering cash management, forecasting & funding solutions for treasury globally.\"),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.bankofamerica.com/en-us/job-detail/21075889/full-stack-developer-dublin-ireland\"}),\"See more and apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"bofa-web-ui\"},\"Senior Web UI Developer - Risk & Finance Technology \")),\"We are looking for a talented senior web UI developer to join the DublinDevLab. You will be responsible for designing and building cutting edge web UI solutions to help solve complex business problems within one of the most interesting parts of one of the world\\u2019s largest banks. The successful candidate will be an experienced engineer, who is adaptable and enthusiastic about learning new technologies and business domains.\"),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.bankofamerica.com/en-us/job-detail/22023891/senior-web-ui-developer-risk-finance-technology-dublin-ireland\"}),\"See more and apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"bofa-hadoop\"},\"Software Engineer \\u2013 Hadoop \\u2013 Risk & Finance Technology\")),\"We are looking for a talented senior Hadoop developer to work in the Risk & Finance Technology team. You will be responsible for designing and developing BigData ETL solutions to help solve complex business problems within one of the most interesting parts of one of the world\\u2019s largest banks. You will work closely with business users, business analysts and development colleagues to build best in class risk management solutions.\"),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.bankofamerica.com/en-us/job-detail/22021507/software-engineer-hadoop-risk-finance-technology-dublin-ireland\"}),\"See more and apply here\"))),mdx(\"article\",e({},{className:\"accent-left\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"superblocks\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#superblocks\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://www.superblocks.com/?referrer=europython\"}),\"Superblocks\"))),mdx(\"p\",{parentName:\"article\"},\"Superblocks is the all-in-one programmable platform for developers to build beautiful, secure, enterprise-grade internal tools fast: build any internal app, automate any workflow and schedule any job. Developers use the Superblocks development environment to bind their datasources and UI components together using drag and drop or code. Many programming languages are already supported, including Javascript, Python and SQL.  Superblocks apps, workflows, or jobs are then deployed onto a custom URL with permissions, SSO, audit logging, and other enterprise functionality.\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"superblocks-frontend\"},\"Software Engineer - Frontend\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://boards.greenhouse.io/superblocks/jobs/4024363005\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"superblocks-backend\"},\"Software Engineer - Backend\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://boards.greenhouse.io/superblocks/jobs/4024362005\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"superblocks-solutions\"},\"Solutions Engineer\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://boards.greenhouse.io/superblocks/jobs/4024365005\"}),\"Apply here\"))),mdx(\"article\",e({},{className:\"accent-right\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"bloomberg\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#bloomberg\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://careers.bloomberg.com\"}),\"Bloomberg\"))),mdx(\"p\",{parentName:\"article\"},\"Bloomberg is building the world's most trusted information network for financial professionals. Our 6,500+ engineers are dedicated to advancing and building new systems for the Bloomberg Terminal to solve complex, real-world problems. \\u200BWe trust our teams to choose the right technologies for the job, and, at Bloomberg, the answer is often Python. We employ an active community of 2,000+ Python developers who have their hands in everything from financial analytics and data science to contributing to open source technologies like Project Jupyter. Bloomberg is proud to be a Visionary Sponsor of the Python Software Foundation and host of many Python community events around the world. Learn more at \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://TechAtBloomberg.com/python\"}),\"https://TechAtBloomberg.com/python\"),\".\"),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"bloomberg-sr-eng\"},\"Senior Software Engineer - Commodities Navigation and Analytics (London)\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.bloomberg.com/job/detail/103840\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"bloomberg-sw-eng\"},\"Senior Software Engineer (C++/Python) - Electronic Trading Data Science Platform (London)\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.bloomberg.com/job/detail/93050\"}),\"Apply here\")),mdx(\"details\",null,mdx(\"summary\",null,mdx(\"h2\",{id:\"bloomberg-eng-trade\"},\"Senior Software Engineer - Trade Processing (London)\"))),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.bloomberg.com/job/detail/90500\"}),\"Apply here\"))),mdx(\"article\",e({},{className:\"accent-left\"}),mdx(\"h2\",e({parentName:\"article\"},{id:\"google-cloud\"}),mdx(\"a\",e({parentName:\"h2\"},{href:\"#google-cloud\"}),mdx(\"a\",e({parentName:\"a\"},{href:\"https://careers.google.com\"}),\"Google Cloud\"))),mdx(\"p\",{parentName:\"article\"},\"Find your next job at Google \\u2022 Google Cloud \\u2022 YouTube and create \\u2022 design \\u2022 code \\u2022 build for everyone: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.google.com\"}),\"https://careers.google.com\")),mdx(\"p\",{parentName:\"article\"},\"We currently have 1,400+ full-time job positions for Pythonistas worldwide:\"),mdx(\"p\",{parentName:\"article\"},mdx(\"a\",e({parentName:\"p\"},{href:\"https://careers.google.com/jobs/results?employment_type=FULL_TIME&q=python\"}),\"Apply here\"))))}MDXContent.isMDXComponent=!0;\n","scope":{}},"path":"jobs-board","title":"Jobs Board","className":null},"__N_SSG":true}