{"pageProps":{"path":"/speaker/antonis-christofides","speaker":{"code":"QRKRQL","name":"Antonis Christofides","biography":"I've been writing software for more than 30 years. I’ve written software to streamline the management of hydro/meteorological measurements; to make time series visualization and processing easy; to provide irrigation advice; and much more. I have been working with automatic meteorological stations since 1992; I’ve occasionally written programs to interface directly with meteorological loggers; I’ve dug out dusty old handwritten weather observations and keyed them in myself; I have created various web sites and web-accessible databases; I’ve administrated servers, including email and network, and high-availability databases with automatic failover. I have written the book on Django deployment (https://djangodeployment.com).\r\n\r\nIn research, I’ve worked on water-related decision making when there are conflicting objectives; on evaluation of climate models; on causation and determinism in hydrology and the climate; and more. My opinion on climate change is that there is no evidence that it is man-made.\r\n\r\nI help scientists and engineers create software. In particular, I help them bring their models to the web.","avatar":"https://www.gravatar.com/avatar/39d2ea0a36d1740e5f544076955a4b30","slug":"antonis-christofides","affiliation":"IRMASYS P.C.","homepage":"https://antonischristofides.com","twitter":"@a_christofides","bioSource":{"compiledSource":"var l=Object.defineProperty,h=Object.defineProperties;var p=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var m=(e,t,a)=>t in e?l(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,i=(e,t)=>{for(var a in t||(t={}))r.call(t,a)&&m(e,a,t[a]);if(n)for(var a of n(t))s.call(t,a)&&m(e,a,t[a]);return e},d=(e,t)=>h(e,p(t));var c=(e,t)=>{var a={};for(var o in e)r.call(e,o)&&t.indexOf(o)<0&&(a[o]=e[o]);if(e!=null&&n)for(var o of n(e))t.indexOf(o)<0&&s.call(e,o)&&(a[o]=e[o]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var o=a,{components:e}=o,t=c(o,[\"components\"]);return mdx(MDXLayout,d(i(i({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"I've been writing software for more than 30 years. I\\u2019ve written software to streamline the management of hydro/meteorological measurements; to make time series visualization and processing easy; to provide irrigation advice; and much more. I have been working with automatic meteorological stations since 1992; I\\u2019ve occasionally written programs to interface directly with meteorological loggers; I\\u2019ve dug out dusty old handwritten weather observations and keyed them in myself; I have created various web sites and web-accessible databases; I\\u2019ve administrated servers, including email and network, and high-availability databases with automatic failover. I have written the book on Django deployment (\",mdx(\"a\",i({parentName:\"p\"},{href:\"https://djangodeployment.com\"}),\"https://djangodeployment.com\"),\").\"),mdx(\"p\",null,\"In research, I\\u2019ve worked on water-related decision making when there are conflicting objectives; on evaluation of climate models; on causation and determinism in hydrology and the climate; and more. My opinion on climate change is that there is no evidence that it is man-made.\"),mdx(\"p\",null,\"I help scientists and engineers create software. In particular, I help them bring their models to the web.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"homepageUrl":"https://antonischristofides.com"}},"__N_SSG":true}