{"pageProps":{"path":"/speaker/arjumand-younus","speaker":{"code":"7CNJVE","name":"Arjumand Younus","biography":"Dr Arjumand Younus is a Research Scientist in Afiniti AI, and a part-time lecturer in Technological University Dublin. Before this appointment, Arjumand has contributed to SFI funded projects during her different post-doctoral positions at CONSUS-UCD and INSIGHT-UCD. She is also serving in the capacity of co-director for Women in Research Ireland which is a volunteer-run registered charity working for better representation of women and under-represented groups in academia.\r\n\r\nArjumand received a joint PhD in Computer Science from National University of Ireland Galway (Ireland) and University of Milano-Bicocca (Italy), MS degree in Computer Science from Korea Advanced Institute of Science and Technology (South Korea), and BS in Computer Science from the University of Karachi (Pakistan). Her research focuses on Machine Learning, Natural Language Processing, and Data Science for Social Good. Arjumand is passionate about the value of artificial intelligence technology to make society better, and at the moment is involved as an academic partner in various AI for Social Good projects.","avatar":"https://program.europython.eu/media/avatars/headshot_arjumandyounus_KdYrxO6.jpg","slug":"arjumand-younus","affiliation":"Afiniti AI","homepage":"https://arjumandyounus.github.io/","twitter":"ArjumandYounus","bioSource":{"compiledSource":"var p=Object.defineProperty,l=Object.defineProperties;var f=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,c=Object.prototype.propertyIsEnumerable;var s=(e,n,o)=>n in e?p(e,n,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[n]=o,t=(e,n)=>{for(var o in n||(n={}))r.call(n,o)&&s(e,o,n[o]);if(i)for(var o of i(n))c.call(n,o)&&s(e,o,n[o]);return e},d=(e,n)=>l(e,f(n));var u=(e,n)=>{var o={};for(var a in e)r.call(e,a)&&n.indexOf(a)<0&&(o[a]=e[a]);if(e!=null&&i)for(var a of i(e))n.indexOf(a)<0&&c.call(e,a)&&(o[a]=e[a]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var a=o,{components:e}=a,n=u(a,[\"components\"]);return mdx(MDXLayout,d(t(t({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Dr Arjumand Younus is a Research Scientist in Afiniti AI, and a part-time lecturer in Technological University Dublin. Before this appointment, Arjumand has contributed to SFI funded projects during her different post-doctoral positions at CONSUS-UCD and INSIGHT-UCD. She is also serving in the capacity of co-director for Women in Research Ireland which is a volunteer-run registered charity working for better representation of women and under-represented groups in academia.\"),mdx(\"p\",null,\"Arjumand received a joint PhD in Computer Science from National University of Ireland Galway (Ireland) and University of Milano-Bicocca (Italy), MS degree in Computer Science from Korea Advanced Institute of Science and Technology (South Korea), and BS in Computer Science from the University of Karachi (Pakistan). Her research focuses on Machine Learning, Natural Language Processing, and Data Science for Social Good. Arjumand is passionate about the value of artificial intelligence technology to make society better, and at the moment is involved as an academic partner in various AI for Social Good projects.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"homepageUrl":"https://arjumandyounus.github.io/"}},"__N_SSG":true}