{"pageProps":{"path":"/speaker/cheuk-ting-ho","speaker":{"code":"8EGVC9","name":"Cheuk Ting Ho","biography":"Before working in Developer Relations, Cheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Relations Lead at TerminusDB - an open-source graph database. Cheuk maintains its Python client and engages with its user community daily.\r\n\r\nBesides her work, Cheuk enjoys talking about Python on personal streaming platforms and podcasts. Cheuk has also been a speaker at Universities and various conferences. Besides speaking at conferences, Cheuk also organises events for developers. Conferences that Cheuk has organized include EuroPython (which she is a board member of), PyData Global and Pyjamas Conf. Believing in Tech Diversity and Inclusion, Cheuk constantly organizes workshops and mentored sprints for minority groups. In 2021, Cheuk has become a Python Software Foundation fellow.","avatar":"https://program.europython.eu/media/avatars/Cheuk_Ting_Ho_myGoldi.JPG","slug":"cheuk-ting-ho","affiliation":"TerminusDB","homepage":"https://cheuk.dev/","twitter":"@cheukting_ho","bioSource":{"compiledSource":"var c=Object.defineProperty,p=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var s=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var h=(e,n,o)=>n in e?c(e,n,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[n]=o,t=(e,n)=>{for(var o in n||(n={}))i.call(n,o)&&h(e,o,n[o]);if(s)for(var o of s(n))r.call(n,o)&&h(e,o,n[o]);return e},u=(e,n)=>p(e,d(n));var l=(e,n)=>{var o={};for(var a in e)i.call(e,a)&&n.indexOf(a)<0&&(o[a]=e[a]);if(e!=null&&s)for(var a of s(e))n.indexOf(a)<0&&r.call(e,a)&&(o[a]=e[a]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var a=o,{components:e}=a,n=l(a,[\"components\"]);return mdx(MDXLayout,u(t(t({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Before working in Developer Relations, Cheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Relations Lead at TerminusDB - an open-source graph database. Cheuk maintains its Python client and engages with its user community daily.\"),mdx(\"p\",null,\"Besides her work, Cheuk enjoys talking about Python on personal streaming platforms and podcasts. Cheuk has also been a speaker at Universities and various conferences. Besides speaking at conferences, Cheuk also organises events for developers. Conferences that Cheuk has organized include EuroPython (which she is a board member of), PyData Global and Pyjamas Conf. Believing in Tech Diversity and Inclusion, Cheuk constantly organizes workshops and mentored sprints for minority groups. In 2021, Cheuk has become a Python Software Foundation fellow.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"homepageUrl":"https://cheuk.dev/"}},"__N_SSG":true}