{"pageProps":{"path":"/speaker/felipe-huici","speaker":{"code":"GXDRHH","name":"Felipe Huici","biography":"Dr. Felipe Huici is CEO and Co-Founder at Unikraft UG, a start-up dedicated to lightweight and open source virtualization technologies and significantly lowering cloud infrastructure bills. In addition, Felipe is a chief researcher at NEC Laboratories Europe in Heidelberg, Germany where his main research and interests lie in the areas of high-performance software systems, and in particular specialization, virtualization and security. He has been published in several top-tier conferences and journals such as SOSP, ASPLOS, OSDI, Eurosys, SIGCOMM, NSDI, CoNEXT, and SIGCOMM CCR. Finally, Felipe is one of the founders and maintainers of the Linux Foundation Unikraft open source project.","avatar":"https://program.europython.eu/media/avatars/felipehuici_ixalJ4j.jpeg","slug":"felipe-huici","affiliation":"Unikraft UG and NEC Laboratories Europe GmbH","homepage":"https://unikraft.io/","twitter":null,"bioSource":{"compiledSource":"var d=Object.defineProperty,p=Object.defineProperties;var h=Object.getOwnPropertyDescriptors;var t=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var u=(e,n,i)=>n in e?d(e,n,{enumerable:!0,configurable:!0,writable:!0,value:i}):e[n]=i,o=(e,n)=>{for(var i in n||(n={}))r.call(n,i)&&u(e,i,n[i]);if(t)for(var i of t(n))s.call(n,i)&&u(e,i,n[i]);return e},c=(e,n)=>p(e,h(n));var l=(e,n)=>{var i={};for(var a in e)r.call(e,a)&&n.indexOf(a)<0&&(i[a]=e[a]);if(e!=null&&t)for(var a of t(e))n.indexOf(a)<0&&s.call(e,a)&&(i[a]=e[a]);return i};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var a=i,{components:e}=a,n=l(a,[\"components\"]);return mdx(MDXLayout,c(o(o({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Dr. Felipe Huici is CEO and Co-Founder at Unikraft UG, a start-up dedicated to lightweight and open source virtualization technologies and significantly lowering cloud infrastructure bills. In addition, Felipe is a chief researcher at NEC Laboratories Europe in Heidelberg, Germany where his main research and interests lie in the areas of high-performance software systems, and in particular specialization, virtualization and security. He has been published in several top-tier conferences and journals such as SOSP, ASPLOS, OSDI, Eurosys, SIGCOMM, NSDI, CoNEXT, and SIGCOMM CCR. Finally, Felipe is one of the founders and maintainers of the Linux Foundation Unikraft open source project.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"homepageUrl":"https://unikraft.io/"}},"__N_SSG":true}