{"pageProps":{"path":"/speaker/kelly-schuster-paredes","speaker":{"code":"WKRLRJ","name":"Kelly Schuster - Paredes","biography":"Kelly Schuster-Paredes is the co-host of the Teaching Python Podcast, a mom, world traveler, and teacher.  Kelly has a Masters in Curriculum, Instruction, and Technology from Nova Southeastern University. She has taught in the UK, Peru, and the USA. Kelly specializes in curriculum design, educational coaching, and curriculum development. She got started with integrating technology in the classroom in 2003, dabbled with app design in File Maker, HTML, Robotics, and now spends most of her time learning more Python. She teaches Python and Computer Science to sixth, seventh and eighth grade students at Pine Crest School in Fort Lauderdale, Florida.","avatar":"https://program.europython.eu/media/avatars/IMG_3994_utfoOyN.jpeg","slug":"kelly-schuster-paredes","affiliation":null,"homepage":null,"twitter":null,"bioSource":{"compiledSource":"var d=Object.defineProperty,l=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var h=(e,t,n)=>t in e?d(e,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):e[t]=n,r=(e,t)=>{for(var n in t||(t={}))i.call(t,n)&&h(e,n,t[n]);if(a)for(var n of a(t))s.call(t,n)&&h(e,n,t[n]);return e},c=(e,t)=>l(e,m(t));var u=(e,t)=>{var n={};for(var o in e)i.call(e,o)&&t.indexOf(o)<0&&(n[o]=e[o]);if(e!=null&&a)for(var o of a(e))t.indexOf(o)<0&&s.call(e,o)&&(n[o]=e[o]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var o=n,{components:e}=o,t=u(o,[\"components\"]);return mdx(MDXLayout,c(r(r({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Kelly Schuster-Paredes is the co-host of the Teaching Python Podcast, a mom, world traveler, and teacher.  Kelly has a Masters in Curriculum, Instruction, and Technology from Nova Southeastern University. She has taught in the UK, Peru, and the USA. Kelly specializes in curriculum design, educational coaching, and curriculum development. She got started with integrating technology in the classroom in 2003, dabbled with app design in File Maker, HTML, Robotics, and now spends most of her time learning more Python. She teaches Python and Computer Science to sixth, seventh and eighth grade students at Pine Crest School in Fort Lauderdale, Florida.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}}},"__N_SSG":true}