{"pageProps":{"path":"/speaker/srivatsa-kundurthy","speaker":{"code":"9WBNHR","name":"Srivatsa Kundurthy","biography":"Srivatsa Kundurthy is a student based in the Greater New York City Area. As a Python practitioner, his projects include Open Source Intelligence tools for extracting public data and Python notebooks for explaining and simulating chaotic dynamical systems. His work in machine learning includes studying computer vision for problems in ecology and researching neural networks for predicting states of chaotic dynamical systems. Additionally, he is working with the LAION Research Group to develop and strengthen the world’s largest image-text dataset. Apart from Machine Learning Research, Srivatsa is greatly interested in technology policy and community-related issues, particularly those extending to the accessibility of programming education. On the side, Srivatsa enjoys science communication and stargazing.","avatar":"https://program.europython.eu/media/avatars/IMG-1848-Original-Original_qSILF51.jpg","slug":"srivatsa-kundurthy","affiliation":"The Academy for Mathematics, Science, and Engineering","homepage":null,"twitter":"@srkundurthy","bioSource":{"compiledSource":"var u=Object.defineProperty,y=Object.defineProperties;var p=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var c=(e,t,n)=>t in e?u(e,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):e[t]=n,o=(e,t)=>{for(var n in t||(t={}))s.call(t,n)&&c(e,n,t[n]);if(a)for(var n of a(t))r.call(t,n)&&c(e,n,t[n]);return e},d=(e,t)=>y(e,p(t));var l=(e,t)=>{var n={};for(var i in e)s.call(e,i)&&t.indexOf(i)<0&&(n[i]=e[i]);if(e!=null&&a)for(var i of a(e))t.indexOf(i)<0&&r.call(e,i)&&(n[i]=e[i]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var i=n,{components:e}=i,t=l(i,[\"components\"]);return mdx(MDXLayout,d(o(o({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Srivatsa Kundurthy is a student based in the Greater New York City Area. As a Python practitioner, his projects include Open Source Intelligence tools for extracting public data and Python notebooks for explaining and simulating chaotic dynamical systems. His work in machine learning includes studying computer vision for problems in ecology and researching neural networks for predicting states of chaotic dynamical systems. Additionally, he is working with the LAION Research Group to develop and strengthen the world\\u2019s largest image-text dataset. Apart from Machine Learning Research, Srivatsa is greatly interested in technology policy and community-related issues, particularly those extending to the accessibility of programming education. On the side, Srivatsa enjoys science communication and stargazing.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}}},"__N_SSG":true}