{"pageProps":{"path":"/session/beyond-the-basics-data-visualization-in-python","session":{"code":"LY3NUG","title":"Beyond the Basics: Data Visualization in Python","speakers":[{"code":"9WJJPL","name":"Stefanie Molin","biography":"Stefanie Molin is a software engineer and data scientist at Bloomberg in New York City, where she tackles tough problems in information security, particularly those revolving around data wrangling/visualization, building tools for gathering data, and knowledge sharing. She is also the author of \"Hands-On Data Analysis with Pandas,\" which is currently in its second edition. She holds a bachelor’s of science degree in operations research from Columbia University's Fu Foundation School of Engineering and Applied Science. She is currently pursuing a master’s degree in computer science, with a specialization in machine learning, from Georgia Tech. In her free time, she enjoys traveling the world, inventing new recipes, and learning new languages spoken among both people and computers.","avatar":"https://program.europython.eu/media/avatars/IMG_6741_FP3yFK2.JPG","slug":"stefanie-molin","affiliation":"Bloomberg","homepage":"http://www.columbia.edu/~snm2121/","twitter":"@StefanieMolin","biographySource":{"compiledSource":"var g=Object.defineProperty,u=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(e,n,i)=>n in e?g(e,n,{enumerable:!0,configurable:!0,writable:!0,value:i}):e[n]=i,t=(e,n)=>{for(var i in n||(n={}))r.call(n,i)&&l(e,i,n[i]);if(a)for(var i of a(n))s.call(n,i)&&l(e,i,n[i]);return e},c=(e,n)=>u(e,d(n));var h=(e,n)=>{var i={};for(var o in e)r.call(e,o)&&n.indexOf(o)<0&&(i[o]=e[o]);if(e!=null&&a)for(var o of a(e))n.indexOf(o)<0&&s.call(e,o)&&(i[o]=e[o]);return i};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var o=i,{components:e}=o,n=h(o,[\"components\"]);return mdx(MDXLayout,c(t(t({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,`Stefanie Molin is a software engineer and data scientist at Bloomberg in New York City, where she tackles tough problems in information security, particularly those revolving around data wrangling/visualization, building tools for gathering data, and knowledge sharing. She is also the author of \"Hands-On Data Analysis with Pandas,\" which is currently in its second edition. She holds a bachelor\\u2019s of science degree in operations research from Columbia University's Fu Foundation School of Engineering and Applied Science. She is currently pursuing a master\\u2019s degree in computer science, with a specialization in machine learning, from Georgia Tech. In her free time, she enjoys traveling the world, inventing new recipes, and learning new languages spoken among both people and computers.`))}MDXContent.isMDXComponent=!0;\n","scope":{}}}],"submission_type":"Tutorial","slug":"beyond-the-basics-data-visualization-in-python","track":"PyData: Software Packages & Jupyter","state":"confirmed","abstract":"The human brain excels at finding patterns in visual representations, which is why data visualizations are essential to any analysis. Done right, they bridge the gap between those analyzing the data and those consuming the analysis. However, learning to create impactful, aesthetically-pleasing visualizations can often be challenging. This session will equip you with the skills to make customized visualizations for your data using Python.\r\n\r\nWhile there are many plotting libraries to choose from, the prolific Matplotlib library is always a great place to start. Since various Python data science libraries utilize Matplotlib under the hood, familiarity with Matplotlib itself gives you the flexibility to fine tune the resulting visualizations (e.g., add annotations, animate, etc.). This session will also introduce interactive visualizations using HoloViz, which provides a higher-level plotting API capable of using Matplotlib and Bokeh (a Python library for generating interactive, JavaScript-powered visualizations) under the hood.","abstract_as_a_tweet":"Join @StefanieMolin for her #dataviz in #Python workshop, which covers static, animated, & interactive visualizations with  @matplotlib  +  @HoloViews .","description":"#### Section 1: Getting Started With Matplotlib\r\nWe will begin by familiarizing ourselves with Matplotlib. Moving beyond the default options, we will explore how to customize various aspects of our visualizations. By the end of this section, you will be able to generate plots using the Matplotlib API directly, as well as customize the plots that libraries like pandas and Seaborn create for you.\r\n\r\n#### Section 2: Moving Beyond Static Visualizations\r\nStatic visualizations are limited in how much information they can show. To move beyond these limitations, we can create animated and/or interactive visualizations. Animations make it possible for our visualizations to tell a story through movement of the plot components (e.g., bars, points, lines). Interactivity makes it possible to explore the data visually by hiding and displaying information based on user interest. In this section, we will focus on creating animated visualizations using Matplotlib before moving on to create interactive visualizations in the next section.\r\n\r\n#### Section 3: Building Interactive Visualizations for Data Exploration\r\nWhen exploring our data, interactive visualizations can provide the most value. Without having to create multiple iterations of the same plot, we can use mouse actions (e.g., click, hover, zoom, etc.) to explore different aspects and subsets of the data. In this section, we will learn how to use a few of the libraries in the HoloViz ecosystem to create interactive visualizations for exploring our data utilizing the Bokeh backend.\r\n\r\n---\r\n\r\n####  Prerequisites\r\nThis workshop is for anyone with basic knowledge of Python and an interest in learning how to take their data visualization skills to the next level. We will be working with Jupyter Notebooks, so attendees should familiarize themselves with the interface (i.e., know how to run/edit a cell) beforehand. In addition, a basic understanding of pandas will be beneficial, but is not required; reviewing the first section of [this pandas workshop](https://github.com/stefmolin/pandas-workshop) will be sufficient.\r\n\r\n#### Setup\r\nPlease set up your local environment beforehand per the instructions [here](https://github.com/stefmolin/python-data-viz-workshop#setup-instructions).","duration":"180","python_level":"some","domain_level":"none","delivery":"in-person","room":"Wicklow Hall 2B","start":"2022-07-12T09:30:00+01:00","end":"2022-07-12T11:00:00+01:00","talks_in_parallel":["3B9WHE","3ESVF7","DHHVHZ","KP9CPX","XK833K"],"talks_after":[],"next_talk_code":null,"prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/beyond-the-basics-data-visualization-in-python","type":"Tutorial","abstractSource":{"compiledSource":"var p=Object.defineProperty,c=Object.defineProperties;var y=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var r=(i,t,e)=>t in i?p(i,t,{enumerable:!0,configurable:!0,writable:!0,value:e}):i[t]=e,o=(i,t)=>{for(var e in t||(t={}))s.call(t,e)&&r(i,e,t[e]);if(n)for(var e of n(t))l.call(t,e)&&r(i,e,t[e]);return i},h=(i,t)=>c(i,y(t));var u=(i,t)=>{var e={};for(var a in i)s.call(i,a)&&t.indexOf(a)<0&&(e[a]=i[a]);if(i!=null&&n)for(var a of n(i))t.indexOf(a)<0&&l.call(i,a)&&(e[a]=i[a]);return e};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(e){var a=e,{components:i}=a,t=u(a,[\"components\"]);return mdx(MDXLayout,h(o(o({},layoutProps),t),{components:i,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"The human brain excels at finding patterns in visual representations, which is why data visualizations are essential to any analysis. Done right, they bridge the gap between those analyzing the data and those consuming the analysis. However, learning to create impactful, aesthetically-pleasing visualizations can often be challenging. This session will equip you with the skills to make customized visualizations for your data using Python.\"),mdx(\"p\",null,\"While there are many plotting libraries to choose from, the prolific Matplotlib library is always a great place to start. Since various Python data science libraries utilize Matplotlib under the hood, familiarity with Matplotlib itself gives you the flexibility to fine tune the resulting visualizations (e.g., add annotations, animate, etc.). This session will also introduce interactive visualizations using HoloViz, which provides a higher-level plotting API capable of using Matplotlib and Bokeh (a Python library for generating interactive, JavaScript-powered visualizations) under the hood.\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"descriptionSource":{"compiledSource":"var p=Object.defineProperty,c=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(e,t,i)=>t in e?p(e,t,{enumerable:!0,configurable:!0,writable:!0,value:i}):e[t]=i,a=(e,t)=>{for(var i in t||(t={}))s.call(t,i)&&l(e,i,t[i]);if(n)for(var i of n(t))r.call(t,i)&&l(e,i,t[i]);return e},h=(e,t)=>c(e,d(t));var u=(e,t)=>{var i={};for(var o in e)s.call(e,o)&&t.indexOf(o)<0&&(i[o]=e[o]);if(e!=null&&n)for(var o of n(e))t.indexOf(o)<0&&r.call(e,o)&&(i[o]=e[o]);return i};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var o=i,{components:e}=o,t=u(o,[\"components\"]);return mdx(MDXLayout,h(a(a({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h4\",null,\"Section 1: Getting Started With Matplotlib\"),mdx(\"p\",null,\"We will begin by familiarizing ourselves with Matplotlib. Moving beyond the default options, we will explore how to customize various aspects of our visualizations. By the end of this section, you will be able to generate plots using the Matplotlib API directly, as well as customize the plots that libraries like pandas and Seaborn create for you.\"),mdx(\"h4\",null,\"Section 2: Moving Beyond Static Visualizations\"),mdx(\"p\",null,\"Static visualizations are limited in how much information they can show. To move beyond these limitations, we can create animated and/or interactive visualizations. Animations make it possible for our visualizations to tell a story through movement of the plot components (e.g., bars, points, lines). Interactivity makes it possible to explore the data visually by hiding and displaying information based on user interest. In this section, we will focus on creating animated visualizations using Matplotlib before moving on to create interactive visualizations in the next section.\"),mdx(\"h4\",null,\"Section 3: Building Interactive Visualizations for Data Exploration\"),mdx(\"p\",null,\"When exploring our data, interactive visualizations can provide the most value. Without having to create multiple iterations of the same plot, we can use mouse actions (e.g., click, hover, zoom, etc.) to explore different aspects and subsets of the data. In this section, we will learn how to use a few of the libraries in the HoloViz ecosystem to create interactive visualizations for exploring our data utilizing the Bokeh backend.\"),mdx(\"hr\",null),mdx(\"h4\",null,\"Prerequisites\"),mdx(\"p\",null,\"This workshop is for anyone with basic knowledge of Python and an interest in learning how to take their data visualization skills to the next level. We will be working with Jupyter Notebooks, so attendees should familiarize themselves with the interface (i.e., know how to run/edit a cell) beforehand. In addition, a basic understanding of pandas will be beneficial, but is not required; reviewing the first section of \",mdx(\"a\",a({parentName:\"p\"},{href:\"https://github.com/stefmolin/pandas-workshop\"}),\"this pandas workshop\"),\" will be sufficient.\"),mdx(\"h4\",null,\"Setup\"),mdx(\"p\",null,\"Please set up your local environment beforehand per the instructions \",mdx(\"a\",a({parentName:\"p\"},{href:\"https://github.com/stefmolin/python-data-viz-workshop#setup-instructions\"}),\"here\"),\".\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"sessionsAfter":[],"sessionsInParallel":[{"code":"3B9WHE","title":"Python objects under the hood","speakers":[{"code":"BLNV7P","name":"Rodrigo Girão Serrão","biography":"Rodrigo has always been fascinated by problem solving and that is why he picked up programming – so that he could solve more problems. He also loves sharing knowledge, and that is why he spends so much time writing articles in his blog [mathspp.com/blog](http://mathspp.com/blog), writing on Twitter [@mathsppblog](https://twitter.com/mathsppblog), and giving workshops and courses.\r\nYou can also find his past talks [here](https://github.com/mathspp/talks).\r\n\r\nHis main areas of scientific interest are mathematics (numerical analysis in particular) and programming in general (with a preference for the Python and APL languages), but Rodrigo also enjoys reading fantasy books, watching silly comedy movies and eating chocolate.","avatar":"https://program.europython.eu/media/avatars/rgs_square_pMKs1bG.jpg","slug":"rodrigo-girao-serrao","affiliation":"Freelance","homepage":"https://mathspp.com","twitter":"@mathsppblog"}],"submission_type":"Tutorial","slug":"python-objects-under-the-hood","track":"(c)Python Internals","state":"confirmed","abstract":"Have you ever heard of Python's **magic** methods?\r\nI am sorry, but they are not that “magic”!\r\nI agree they are really cool, but dunder methods (the name they usually go by) are just regular Python methods that you implement!\r\nAnd it is my job to help **you** learn about them.\r\n\r\n**Dunder methods** are the methods that you need to implement when you want your objects to interact with the syntax of Python.\r\nDo you want `len` to be callable on your objects? Implement `__len__`.\r\nDo you want your objects to be iterables? Implement `__iter__`.\r\nDo you want arithmetics to work on your objects? Implement `__add__` (and a bunch of others!).\r\nJust to name a few things your objects could be doing.\r\n\r\nIn this training, we will go over a series of small use cases for many of the existing dunder methods: we will learn about the way in which each dunder method is supposed to work and then we implement it.\r\nThis will make you a more well-rounded Python developer because you will have a greater appreciation for how things work in Python.\r\nI will also show you the approaches I follow when I am learning about a new dunder method and trying to understand how it works, which will help you explore the remainder dunder methods by yourself.\r\n\r\nFor this training, you need Python 3.8+ and your code editor of choice.\r\n\r\n[Get the slides, exercises, and other resources on Github](https://github.com/mathspp/talks).","abstract_as_a_tweet":"Come take a peek at Python objects under the hood! In this training you will learn all about dunder methods in Python and how they customise the way in which your objects interact with Python syntax.","description":"","duration":"180","python_level":"some","domain_level":"none","delivery":"in-person","room":"Wicklow Hall 1","start":"2022-07-12T09:30:00+01:00","end":"2022-07-12T11:00:00+01:00","talks_in_parallel":["3ESVF7","DHHVHZ","KP9CPX","LY3NUG","XK833K"],"talks_after":[],"next_talk_code":null,"prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/python-objects-under-the-hood"},{"code":"3ESVF7","title":"Trans*Code","speakers":[{"code":"SM8RTE","name":"Naomi Ceder","biography":"Founder of Trans*Code. An elected fellow of the Python Software Foundation, Naomi is a past chair of its board of directors. She also speaks internationally about the Python community, and on inclusion and diversity in technology in general.","avatar":null,"slug":"naomi-ceder","affiliation":"Trans*Code","homepage":null,"twitter":null}],"submission_type":"Special Workshop","slug":"trans-code","track":"Events","state":"confirmed","abstract":"Trans\\*Code  is a free full day workshop & hackday open to trans and non-binary folk, allies, coders, designers and visionaries of all sorts.\r\n\r\nTrans*Code events aim to help draw attention to transgender issues through informal, topic-focused hackdays. Coders, designers, activists, and community members not currently working in technology are also encouraged to participate.\r\n\r\nCome join members of the trans and non-binary community and allies for this day of hacking, sharing, community, and fun.","abstract_as_a_tweet":"Trans*Code will be at @europython in Dublin July 12!  Trans/nb folk, allies, coders (all langs), designers, visionaries of all sorts welcome!","description":"# Trans\\*Code @ EuroPython\r\nThe Trans*Code event at EuroPython will take place on Tuesday 12 July, 2022.\r\n\r\nTrans\\*Code is open to trans and non-binary folk, allies, coders, designers and visionaries of all sorts, \r\n\r\nTrans\\*Code events aim to help draw attention to transgender issues through informal, topic-focused hackdays. Trans\\*Code started in London, inspired by the groundbreaking Trans\\*H4CK events in the USA created by Dr. Kortney Ziegler. Since the first event in 2015 there have been more than a dozen Trans\\*Code events in 3 countries, which have spread awareness, built community, and helped form friendships. \r\n\r\nCoders, designers, activists, and community members not currently working in technology are all encouraged to participate. Trans\\*Code participants from all backgrounds come together to spend a day working together to create prototypes around the themes of transgender issues and access to technology.\r\n\r\nIf you have an idea, or want to work with others to learn about and improve the situation of the trans and non-binary communities through technology, please join us.","duration":"360","python_level":"none","domain_level":"none","delivery":"in-person","room":"Liffey Hall 1","start":"2022-07-12T09:30:00+01:00","end":"2022-07-12T11:00:00+01:00","talks_in_parallel":["3B9WHE","DHHVHZ","KP9CPX","LY3NUG","XK833K"],"talks_after":[],"next_talk_code":null,"prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/trans-code"},{"code":"DHHVHZ","title":"Picking What to Watch Next - build a recommendation system","speakers":[{"code":"8EGVC9","name":"Cheuk Ting Ho","biography":"Before working in Developer Relations, Cheuk has been a Data Scientist in various companies which demands high numerical and programmatical skills, especially in Python. To follow her passion for the tech community, now Cheuk is the Developer Relations Lead at TerminusDB - an open-source graph database. Cheuk maintains its Python client and engages with its user community daily.\r\n\r\nBesides her work, Cheuk enjoys talking about Python on personal streaming platforms and podcasts. Cheuk has also been a speaker at Universities and various conferences. Besides speaking at conferences, Cheuk also organises events for developers. Conferences that Cheuk has organized include EuroPython (which she is a board member of), PyData Global and Pyjamas Conf. Believing in Tech Diversity and Inclusion, Cheuk constantly organizes workshops and mentored sprints for minority groups. In 2021, Cheuk has become a Python Software Foundation fellow.","avatar":"https://program.europython.eu/media/avatars/Cheuk_Ting_Ho_myGoldi.JPG","slug":"cheuk-ting-ho","affiliation":"TerminusDB","homepage":"https://cheuk.dev/","twitter":"@cheukting_ho"}],"submission_type":"Tutorial","slug":"picking-what-to-watch-next-build-a-recommendation-system","track":"PyData: Machine Learning, Stats","state":"confirmed","abstract":"Recommendation algorithms are the driving force of many businesses: e-commerce, personalized advertisement, on-demand entertainment. Computer algorithms know what you like and present you with things that are customized for you. Here we will explore how to do that by building a system ourselves.","abstract_as_a_tweet":"Recommendation algorithms are the driving force of many businesses, here we will explore how to do that by building a system ourselves.","description":"**Get the workshop project repo in advance: https://github.com/Cheukting/knn_recommender**\r\n\r\nIn this workshop, we will use MovieLens Datasets to build a very basic recommendation engine. The model will be KNN Item-Based, meaning based on show information, it suggests users who have watched X show a Y show which is similar to that one. While doing it, we will do data transformation with Pandas and Scipy, and train the model with Scikit-learn.\r\n\r\n**For whom is your Workshop**\r\nData Scientist or developers who have no experience in building a recommendation engine and is curious how it can be done. The model we built is in no way good enough to be deployed as a product but would be a very good first model to learn from and get the idea of how machine learning can be used in finding correlations between items.\r\n\r\n**Short Format of your Workshop**\r\nOverview-10 min, Lecture - 30 mins, Breaks - 20 minutes, Hands-on training - 120 mins, Closing - 10 mins\r\n\r\n**Workshop Agenda**\r\nOverview-10 min\r\n\r\nIn this session, we will go through the workshop structure, introduce the steps that we take and the tools that we will be using in the workshop.\r\n\r\nLecture - 30 mins\r\n\r\nIn this session, through slides and presentation, we will go through some knowledge about recommendation engines, what models are available in the market and how they work. We will discuss their advantages and disadvantages and the fundamental theories that work behind the scenes. This will include the model that we are going to build and the more complicated ones that are more commonly used in business.\r\n\r\nBreaks- 20 minutes\r\n\r\nA short break, overrun buffer, answering questions and setup for the hands-on training.\r\n\r\nHands-on training - 120 mins\r\n\r\nAt the start of this session, we will have a look at the project skeleton and look at the functions that we will implement in this workshop. (10 mins)\r\n\r\nThen we will work on the part that transforms the data into a format that is ready to be trained with the KNN model. (50mins)\r\n\r\nAfterwards, we will work on the part that train the KNN model. Here we will run some experiments and play with different parameters, for example, different similarity metrics, in training. (50 mins)\r\n\r\nFinally, we will test our recommender in the CLI. (10mins)\r\n\r\nBonus: we will test our recommender in the browser with PyScript\r\n\r\nClosing - 10 mins\r\n\r\nIn this session, we will wrap up what we learned and suggest further learning materials to those who may want to study further in this topic.\r\n\r\n**What is required from attendees**\r\nA computer with a stable internet connection; Python 3.9 or above and poetry installed; An opened mind and ready to learn something new\r\n\r\n**What Attendees will Learn**\r\nBy the end of the workshop, you will have built your first recommendation engine. You will be given enough information about how to build a better one and where to study further in you are inspired to be an expert in this field.\r\n\r\n**Course Benefits**\r\nYou will have learned a new skill set that may assist you in your next data science project. You will be inspired to study further to be able to build a better recommendation engine or do your own research on related topics.","duration":"180","python_level":"some","domain_level":"none","delivery":"in-person","room":"Liffey Hall 2","start":"2022-07-12T09:30:00+01:00","end":"2022-07-12T11:00:00+01:00","talks_in_parallel":["3B9WHE","3ESVF7","KP9CPX","LY3NUG","XK833K"],"talks_after":[],"next_talk_code":null,"prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/picking-what-to-watch-next-build-a-recommendation-system"},{"code":"KP9CPX","title":"Inspect and try to interpret your scikit-learn machine-learning models","speakers":[{"code":"KMDJAL","name":"Guillaume Lemaitre","biography":"I am a research engineer. I have a PhD in computer science and have been a scikit-learn core developer since 2017.","avatar":"https://program.europython.eu/media/avatars/guillaumelemaitre.jpg__200x200_q85_crop_subsampling-2_upscale_9Ptqss3.jpg","slug":"guillaume-lemaitre","affiliation":"Inria","homepage":"https://glemaitre.github.io/","twitter":"@glemaitre"}],"submission_type":"Tutorial","slug":"inspect-and-try-to-interpret-your-scikit-learn-machine-learning-models","track":"PyData: Machine Learning, Stats","state":"confirmed","abstract":"This tutorial is subdivided into three parts.\r\n\r\nFirst, we focus on the family of linear models and present the common pitfalls to be aware of when interpreting the coefficients of such models.\r\n\r\nThen, we look at a larger range of models (e.g. gradient-boosting) and put into practice available inspection techniques developed in scikit-learn to inspect such models.\r\n\r\nFinally, we present other tools to interpret models, not currently available in scikit-learn, but widely used. in practice.","abstract_as_a_tweet":"Inpsect and try to interpret your scikit-learn machine-learning models","description":"Find the link to the material and minimal installation instructions: https://github.com/glemaitre/eupython_2022\r\n\r\nThis tutorial is subdivided into three parts.\r\n\r\nFirst, we focus on the family of linear models and present the common pitfalls to be aware of when interpreting the coefficients of such models.\r\n\r\nThen, we look at a larger range of models (e.g. gradient-boosting) and put into practice available inspection techniques developed in scikit-learn to inspect such models.\r\n\r\nFinally, we present other tools to interpret models, not currently available in scikit-learn, but widely used. in practice.","duration":"180","python_level":"some","domain_level":"some","delivery":"in-person","room":"Wicklow Hall 2A","start":"2022-07-12T09:30:00+01:00","end":"2022-07-12T11:00:00+01:00","talks_in_parallel":["3B9WHE","3ESVF7","DHHVHZ","LY3NUG","XK833K"],"talks_after":[],"next_talk_code":null,"prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/inspect-and-try-to-interpret-your-scikit-learn-machine-learning-models"},{"code":"XK833K","title":"Beginners' Day - Humble Data","speakers":[{"code":"CAXDNR","name":"Laís Carvalho","biography":"Developer Advocate, Laís had led events in tech communities to promote the use and diminish the entry barrier to the Python programming language. Board member of Python Ireland, Member of the EuroPython Society and PyLadies Dublin, she has a habit of making fun of everything.","avatar":"https://program.europython.eu/media/avatars/profile_lais_cyrXJVC.jpeg","slug":"lais-carvalho","affiliation":"Python Ireland","homepage":null,"twitter":"@lais_bsc"}],"submission_type":"Special Workshop","slug":"beginners-day-humble-data","track":"Events","state":"confirmed","abstract":"Would you like to learn to code but don’t know where to start? Taking your first steps in programming can seem like an impossible task so we’ve decided to put on a workshop to show 30 beginners how it can be done and share our passion for the world of data science.","abstract_as_a_tweet":"Would you like to learn to code but don’t know where to start? Join us on the Beginner's Day Humble Data Workshop on July 12th at EuroPython.","description":"We invite those from under-represented groups in data to apply to join us on Tuesday 12th July 2022 for the EuroPython Beginners' Day - Humble Data Workshop. In this workshop, you will learn the basics of programming in Python, as well as how to use tools such as Jupyter Notebook and the different standard Python libraries used to analyse data.\r\n\r\nYou will be learning in small groups, each with an assigned mentor to guide you through the workshop materials and answer your questions. This will all be facilitated online through the wonders of modern technology. You can expect plenty of exercises, quizzes and games, and inspiring talks from those who were once in your shoes.\r\n\r\nThis workshop is being run by data scientists and software engineers dedicated to the spirit of Open Source. Every day we benefit from the hard work of others when we use free open tools. This is our way of giving back.\r\n\r\nYou can sign up here: https://docs.google.com/forms/u/9/d/e/1FAIpQLSfthTbaaZgKPc-HvCATc2hii-aNfdAnjHnFM6EQzZAgYpeeBQ/viewform\r\n\r\nWe thank EuroPython for their support in facilitating this workshop. <3","duration":"360","python_level":"none","domain_level":"none","delivery":"in-person","room":"Liffey Meeting Room 2","start":"2022-07-12T09:30:00+01:00","end":"2022-07-12T11:00:00+01:00","talks_in_parallel":["3B9WHE","3ESVF7","DHHVHZ","KP9CPX","LY3NUG"],"talks_after":[],"next_talk_code":null,"prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/beginners-day-humble-data"}]},"__N_SSG":true}