{"pageProps":{"path":"/session/python-visual-studio-code-revolutionizing-the-way-you-do-data-science","session":{"code":"DYDA3H","title":"Python & Visual Studio Code - Revolutionizing the way you do data science","speakers":[{"code":"LLPY8M","name":"Jeffrey Mew","biography":"Jeffrey Mew is a Product Manager at Microsoft working on Python Data Science and AI tooling in VS Code. Specifically, he focuses on making the lives of Data Scientists easier across our ecosystem. Jeffrey holds his Bachelor’s Degree in Computer Engineering from the University of Waterloo. He is a lover of dogs and Python (the language, still unsure about the snake).","avatar":"https://program.europython.eu/media/avatars/IMG_2250_7yWSbHF.jpeg","slug":"jeffrey-mew","affiliation":"Micorosft","homepage":null,"twitter":null,"biographySource":{"compiledSource":"var l=Object.defineProperty,y=Object.defineProperties;var g=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,i=Object.prototype.propertyIsEnumerable;var c=(e,o,t)=>o in e?l(e,o,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[o]=t,s=(e,o)=>{for(var t in o||(o={}))r.call(o,t)&&c(e,t,o[t]);if(a)for(var t of a(o))i.call(o,t)&&c(e,t,o[t]);return e},u=(e,o)=>y(e,g(o));var f=(e,o)=>{var t={};for(var n in e)r.call(e,n)&&o.indexOf(n)<0&&(t[n]=e[n]);if(e!=null&&a)for(var n of a(e))o.indexOf(n)<0&&i.call(e,n)&&(t[n]=e[n]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var n=t,{components:e}=n,o=f(n,[\"components\"]);return mdx(MDXLayout,u(s(s({},layoutProps),o),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Jeffrey Mew is a Product Manager at Microsoft working on Python Data Science and AI tooling in VS Code. Specifically, he focuses on making the lives of Data Scientists easier across our ecosystem. Jeffrey holds his Bachelor\\u2019s Degree in Computer Engineering from the University of Waterloo. He is a lover of dogs and Python (the language, still unsure about the snake).\"))}MDXContent.isMDXComponent=!0;\n","scope":{}}}],"submission_type":"Sponsored Talk","slug":"python-visual-studio-code-revolutionizing-the-way-you-do-data-science","track":"Sponsor","state":"confirmed","abstract":"Visual Studio Code along with GitHub, Codespaces, and Azure Machine Learning have been investing substantially into tools and platforms to make the lives of Python data scientists easier, and we want to share why VS Code is now the #1 tool for Python Data Scientists according to the 2021 Python Software Foundation Developer Survey, and how you can leverage VS Code to take your data science productivity to the next level.\r\n\r\nThis talk will walk through several common Python data science scenarios, showcasing all the productive tooling VS Code has to offer along the way. As a sneak peek, we will be demoing a best in class Jupyter Notebooks experience with VS Code Notebooks, a revolutionary new data cleaning / preparation experience with Data Wrangler in VS Code, collaboration features with GitHub and Codespaces, Azure Machine Learning for deployment, and more!","abstract_as_a_tweet":"Come learn why VS Code is now the #1 tool for Python Data Scientists according to the 2021 Python Software Foundation Developer Survey, and how you can leverage VS Code to take your data science productivity to the next level.","description":"","duration":"30","python_level":"some","domain_level":"none","delivery":"in-person","room":"Liffey A","start":"2022-07-13T11:35:00+01:00","end":"2022-07-13T12:05:00+01:00","talks_in_parallel":["G7MNXY","KMCFKN","MADLNQ","STQEKX","ZYAD7Z"],"talks_after":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"next_talk_code":"N3HJ87","prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/python-visual-studio-code-revolutionizing-the-way-you-do-data-science","type":"Sponsored Talk","abstractSource":{"compiledSource":"var h=Object.defineProperty,u=Object.defineProperties;var p=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(e,o,t)=>o in e?h(e,o,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[o]=t,i=(e,o)=>{for(var t in o||(o={}))s.call(o,t)&&l(e,t,o[t]);if(n)for(var t of n(o))r.call(o,t)&&l(e,t,o[t]);return e},c=(e,o)=>u(e,p(o));var d=(e,o)=>{var t={};for(var a in e)s.call(e,a)&&o.indexOf(a)<0&&(t[a]=e[a]);if(e!=null&&n)for(var a of n(e))o.indexOf(a)<0&&r.call(e,a)&&(t[a]=e[a]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var a=t,{components:e}=a,o=d(a,[\"components\"]);return mdx(MDXLayout,c(i(i({},layoutProps),o),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Visual Studio Code along with GitHub, Codespaces, and Azure Machine Learning have been investing substantially into tools and platforms to make the lives of Python data scientists easier, and we want to share why VS Code is now the #1 tool for Python Data Scientists according to the 2021 Python Software Foundation Developer Survey, and how you can leverage VS Code to take your data science productivity to the next level.\"),mdx(\"p\",null,\"This talk will walk through several common Python data science scenarios, showcasing all the productive tooling VS Code has to offer along the way. As a sneak peek, we will be demoing a best in class Jupyter Notebooks experience with VS Code Notebooks, a revolutionary new data cleaning / preparation experience with Data Wrangler in VS Code, collaboration features with GitHub and Codespaces, Azure Machine Learning for deployment, and more!\"))}MDXContent.isMDXComponent=!0;\n","scope":{}},"descriptionSource":{"compiledSource":"var M=Object.defineProperty,X=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var u=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,a=Object.prototype.propertyIsEnumerable;var s=(o,t,n)=>t in o?M(o,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):o[t]=n,p=(o,t)=>{for(var n in t||(t={}))r.call(t,n)&&s(o,n,t[n]);if(u)for(var n of u(t))a.call(t,n)&&s(o,n,t[n]);return o},y=(o,t)=>X(o,c(t));var D=(o,t)=>{var n={};for(var e in o)r.call(o,e)&&t.indexOf(e)<0&&(n[e]=o[e]);if(o!=null&&u)for(var e of u(o))t.indexOf(e)<0&&a.call(o,e)&&(n[e]=o[e]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var e=n,{components:o}=e,t=D(e,[\"components\"]);return mdx(MDXLayout,y(p(p({},layoutProps),t),{components:o,mdxType:\"MDXLayout\"}))}MDXContent.isMDXComponent=!0;\n","scope":{}}},"sessionsAfter":[{"code":"8KEVYF","title":"The intricate art of making your (internal) clients happy - the story from a Python-centered Infra team","speakers":[{"code":"FSUDFU","name":"Paulina Winkowska","biography":"Paulina fell in love with Python and Machine Learning back in her university years and right now she continues her adventure as Machine Learning Engineer at Brainly. Based in Kraków, Poland, she spends her free time learning ice skating and inline skating.","avatar":"https://program.europython.eu/media/avatars/Zrzut_ekranu_2022-03-24_o_13.52.28_Cropped_1_alDGEnP.png","slug":"paulina-winkowska","affiliation":"Brainly","homepage":null,"twitter":null}],"submission_type":"Talk","slug":"the-intricate-art-of-making-your-internal-clients-happy-the-story-from-a-python-centered-infra-team","track":"Software Engineering & Architecture","state":"confirmed","abstract":"If you have ever worked on an internal company project, you may feel it deep in your bones.\r\nLet’s say that you discovered a need for a generic technological component in your organization’s tech stack. You identified stakeholders, gathered requirements, and started agile iterations on providing it. Then comes a day when you can show the MVP to your internal client! Yet… the client has lost his interest: maybe right now he says that he has already come up with his own temporary solution and he has no intention to switch to another one?  Building internal products differs from commercial ones - there is no flow of cash and your clients are fully transparent.\r\n\r\nIn this talk, I would like to share with you my experience and tips connected with developing such internal tools and standards. All of this from the perspective of a member of the Machine Learning Infra team that is delivering its solutions to a rapidly growing ML department in a company whose product is used by 300 million unique users per month.\r\n\r\nBut let’s be specific! I will talk about:\r\n\r\n- Common pitfalls and try to dig up the reasons for why they happen when developing internal solutions\r\n- How one can approach delivering tools (spoiler: pilot programs, guilds, and more!)\r\n- Learnings from introducing such approaches (what worked, what didn’t) in our case","abstract_as_a_tweet":"Building internal products differs from building commercial ones. Let’s talk about common pitfalls, ways of addressing them, and how one can excel at making their (internal) clients happy.","description":"","duration":"45","python_level":"some","domain_level":"some","delivery":"in-person","room":"Wicklow Hall 1","start":"2022-07-13T12:10:00+01:00","end":"2022-07-13T12:40:00+01:00","talks_in_parallel":["9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"talks_after":[],"next_talk_code":null,"prev_talk_code":"STQEKX","website_url":"https://ep2022.europython.eu/session/the-intricate-art-of-making-your-internal-clients-happy-the-story-from-a-python-centered-infra-team"},{"code":"9LFFBL","title":"Czech Drought Monitoring system – a journey from manual work to global drought monitoring and machine learning, powered by Python","speakers":[{"code":"HGRDTS","name":"Monika Bláhová","biography":"I am Monika Bláhová, currently based at Global Change Research Institute, CAS in Brno, Czech Republic as a GIS data analyst and first-year Ph.D. student. My background is cartography and geoinformatics, and my first experience with coding is from 2013 with JavaScript. Since then, I have walked a long way through learning Python, lecturing PyLadies courses, working as an IT administrator, and finally landing in a big scientific team focusing on climate change’s impact on the agroecosystems at the Czech Academy of Science.","avatar":null,"slug":"monika-blahova","affiliation":"Global Chnage Research Institute, CAS","homepage":"https://www.czechglobe.cz/en/","twitter":null}],"submission_type":"Talk","slug":"czech-drought-monitoring-system-a-journey-from-manual-work-to-global-drought-monitoring-and-machine-learning-powered-by-python","track":"Career, Life,...","state":"confirmed","abstract":"This talk aims to encourage beginner developers not to underestimate the skills and benefits they can bring to various non-IT environments. I joined a team focused on drought research at the Czech Academy of Science in 2016 with a fresh degree in Geoinformatics and minimal experience with coding. Thanks to this very little initial knowledge, we were able to build a robust system providing drought monitoring and forecast for Czechia and also the whole of central Europe. We were able to fight through text files, user inputs, and geodata of all sorts and say goodbye to manual processing thanks to Python and its geospatial and data processing libraries. On the technical side, the presentation should introduce some of the handy geospatial and data processing tools to get your hands on any task, from producing colorful maps to analyzing time trends in satellite imagery. It should also be a guide on identifying needs and building the most necessary data manipulation processes from scratch.","abstract_as_a_tweet":"Python in Czech Drought Monitoring System for geospatial data processing and automatization of tasks in the scientific team.","description":"","duration":"30","python_level":"some","domain_level":"none","delivery":"in-person","room":"Liffey B","start":"2022-07-13T12:10:00+01:00","end":"2022-07-13T12:40:00+01:00","talks_in_parallel":["8KEVYF","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"talks_after":[],"next_talk_code":null,"prev_talk_code":"G7MNXY","website_url":"https://ep2022.europython.eu/session/czech-drought-monitoring-system-a-journey-from-manual-work-to-global-drought-monitoring-and-machine-learning-powered-by-python"},{"code":"E7CX9K","title":"CPython bugs & risky features","speakers":[{"code":"KL7QNZ","name":"disconnect3d","biography":"Disconnect3d is a security engineer at Trail of Bits where he hunt for security bugs in different kinds of software using both manual code analysis and various tools like static analyzers, fuzzers and others. He specializes in low level aspects and likes to understand how things works under the hood. On his free time, Disconnect3d plays CTF security competitions with justCatTheFish team and plays DoTA2 moba game.","avatar":"https://program.europython.eu/media/avatars/cropped_5gRT9IF.jpg","slug":"disconnect3d","affiliation":"Trail of Bits","homepage":"https://disconnect3d.pl/","twitter":"@disconnect3d_pl"}],"submission_type":"Talk","slug":"cpython-bugs-risky-features","track":"~None of the above","state":"confirmed","abstract":"In this talk we will look into a few bug cases or doubtful features in CPython some of which are still present (and known to bugs.python.org) and may impose a security risk for admins or organizations.","abstract_as_a_tweet":"In this talk you can learn about some security risks comming from known(!) CPython bugs or doubtful features","description":"In this talk we will look into a few bug cases or doubtful features in CPython some of which are still present (and known to bugs.python.org) and may impose a security risk for admins or organizations.\r\n\r\nWe will learn why running Python interpreter in random directory can be harmful which is related to interpreter libs loading, a possibility for installed modules to inject code into any Python script execution (even if the installed library is not imported), a socket.inet_aton issue that actually comes from glibc and risks involved with those cases and possible mitigations of those risks.\r\n\r\n@EDIT After talk:\r\n- Watch the talk on https://youtu.be/tRtxCCRdZOs?t=12251\r\n- Slides are available on https://ujeb.se/pybugs","duration":"45","python_level":"some","domain_level":"none","delivery":"in-person","room":"The Auditorium","start":"2022-07-13T12:10:00+01:00","end":"2022-07-13T12:55:00+01:00","talks_in_parallel":["8KEVYF","9LFFBL","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"talks_after":[],"next_talk_code":null,"prev_talk_code":"MADLNQ","website_url":"https://ep2022.europython.eu/session/cpython-bugs-risky-features"},{"code":"N3HJ87","title":"Taking charge of your race conditions","speakers":[{"code":"MHFQEH","name":"Borjan Tchakaloff","biography":"Borjan has been fully focusing his attention on software engineering with Python for the last four years. Prior to that, he was neck deep in the Android world where he was a maintainer of an Android distribution for a phone manufacturer for a few years.\r\nPython came into play there as a nice automation language from applying missing Linux kernel patches to bench testing operating system builds.","avatar":null,"slug":"borjan-tchakaloff","affiliation":"AgOS","homepage":null,"twitter":null}],"submission_type":"Talk","slug":"taking-charge-of-your-race-conditions","track":"Software Engineering & Architecture","state":"confirmed","abstract":"Are you working with threads, processes, or more generally “workers”? And do you have blocks of code that must not be called concurrently? Maybe you didn't even realise it until your system experienced a bug you could not reproduce until the stars aligned. Then you surely know that hope is not the answer to a robust system, we must be prepared to face worst-case scenarios.\r\n\r\nThis talk will first briefly present race conditions, a staple in concurrent computing. We will then compare implicit and explicit concurrency management in your core logic, that is whether you delegate or craft protective logic yourself. Next comes testing, the real crux of the talk, where we will demonstrate how to manufacture a race condition. Finally we will explore how to solve such problems with the built-in tools the Python standard library offers.","abstract_as_a_tweet":"Get a quick tour of race condition handling in Python: what it is, the built-in tools, and how to test for it.","description":"Anybody working with concurrency (threads, processes, or more abstractly workers) eventually encounters a _race condition_. This kind of hair-pulling problem is a staple in computer science. Sometimes you can offload the problem to a lower layer, usually to the database engine, bundling it with atomic transactions. But there are times when you have to take charge of worst-case concurrency scenarios, when your architecture and constraints do not leave room for implicit concurrency management. Then, you need to carefully craft the paths in and out of the critical section, avoiding deadlocks along the way.\r\n\r\nIn this talk, we will focus on how to test your program with a manufactured race condition. If you know it can happen, you'd better cover it in your test suite. We will define a server program called in parallel by multiple clients to illustrate the problem at hand. Then, we will manually set-up a race condition during testing to explore broken behaviour and problematic code.\r\n\r\nThe Python standard library offers all the tools we need to cater for race conditions. We hope the tour we will give allows you to exercise your own race conditions more easily. Why, we even think you will have all the cards in hand to counter them!","duration":"45","python_level":"some","domain_level":"none","delivery":"in-person","room":"Liffey A","start":"2022-07-13T12:10:00+01:00","end":"2022-07-13T12:40:00+01:00","talks_in_parallel":["8KEVYF","9LFFBL","E7CX9K","NUF3K9","QQJFSS","YYQBM3"],"talks_after":[],"next_talk_code":null,"prev_talk_code":"DYDA3H","website_url":"https://ep2022.europython.eu/session/taking-charge-of-your-race-conditions"},{"code":"NUF3K9","title":"Applying machine learning capabilities to wearable IoT devices for boxing technique management","speakers":[{"code":"DEZCB8","name":"Anthony I. Joseph","biography":"Anthony is an Australian software engineer and mathematician. As a UTS MBT graduate, Anthony is the technology co-founder of a property and cycling-tech startup and enjoys teaching and learning coding with the Australian startup scene.","avatar":"https://program.europython.eu/media/avatars/Image_from_iOS_XuOClu6.jpg","slug":"anthony-i-joseph","affiliation":"Bike Party","homepage":"https://bikeparty.com.au","twitter":null}],"submission_type":"Talk","slug":"applying-machine-learning-capabilities-to-wearable-iot-devices-for-boxing-technique-management","track":"PyData: Machine Learning, Stats","state":"confirmed","abstract":"IoT devices are increasing in power and capabilities, now allowing developers to deploy machine learning models on the device. This talk will analyse a boxing training session with motion sensors onboard multiple IoT devices using TinyML: a TensorFlow-based framework. Ultimately, these machine-learning powered IoT devices provide feedback to boxers on their technique.","abstract_as_a_tweet":"Want to use wearable tech and machine learning to become a boxing champ?","description":"Internet of Things (IoT) devices are becoming more advanced through additional sensors, reduced size and increased computational power. In particular, this increase in computational power allows one to run previously-trained machine learning algorithms natively on an IoT device. \r\n\r\nThis presents an exciting opportunity: IoT devices often feature a variety of onboard sensors which can be used as inputs into a machine learning algorithm. \r\n\r\nThis talk will use the presenter's boxing training as a practical example of applying sensor data to a machine learning algorithm. In particular, this talk will demonstrate using motion sensor data obtained on an Arduino Nano 33 BLE Sense configured with TensorFlow Lite. This talk will discuss the entire analytical process from problem and data analysis through to algorithm training and deployment. It will also discuss boxing concepts and how these concepts are modelled in an IoT context.\r\n\r\nThe links to code are provided below:\r\n- https://github.com/ajosephau/boxing_tracker_nano_ble_sense\r\n- https://github.com/ajosephau/boxing_tracker_wio_terminal\r\n\r\nThe slide deck is available here:\r\n- https://www.dropbox.com/s/7448hf8q9umnnse/Wearable%20Tech%20boxing%20technique.pdf?dl=0","duration":"30","python_level":"some","domain_level":"some","delivery":"remote","room":"Liffey Hall 2","start":"2022-07-13T12:10:00+01:00","end":"2022-07-13T12:40:00+01:00","talks_in_parallel":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","QQJFSS","YYQBM3"],"talks_after":[],"next_talk_code":null,"prev_talk_code":"ZYAD7Z","website_url":"https://ep2022.europython.eu/session/applying-machine-learning-capabilities-to-wearable-iot-devices-for-boxing-technique-management"},{"code":"QQJFSS","title":"On the benefits of using workflows: insights from two software tools in the context of computational neuroscience","speakers":[{"code":"YDZC9Z","name":"Aurélien Jaquier","biography":"Hi, my name is Aurélien Jaquier, from Switzerland, I am 27 and I currently work for the Blue Brain Project as a Scientific Software Developer. I have a Master of Science MSc in Physics from the EPFL (Ecole Polytechnique Fédérale de Lausanne), with a master thesis centered on dwarf galaxy simulation.\r\nI love sciences and coding, and have been blessed with a job where I can help fundamental brain research with my coding skills. I develop and maintain different software in the context of neuron cell simulation and electrophysiological parameter optimization, such as EModelRunner, BluePyOpt or eFel.\r\nFeel free to talk to me in english, french or japanese.","avatar":"https://program.europython.eu/media/avatars/photo_DyCk2BJ.jpg","slug":"aurelien-jaquier","affiliation":"Blue Brain Project","homepage":"https://www.epfl.ch/research/domains/bluebrain/","twitter":null}],"submission_type":"Poster","slug":"on-the-benefits-of-using-workflows-insights-from-two-software-tools-in-the-context-of-computational-neuroscience","track":"Posters","state":"confirmed","abstract":"The Blue Brain Project strives to simulate the whole mouse brain. The amount of data and code this implies is astoundingly high, and it requires the development of software tools that have both a strict and clear structure and that are resilient to errors that will manifest when developing complex code. Workflows are a straightforward way to maintain structure in toolchains that grow increasingly complex. Workflow management packages such as Luigi bring functionality to run different tasks in parallel, keep track of completed tasks and improve the reproducibility. This poster will present two Blue Brain Project software tools, the e-model-packages software and BluePyEModel, focusing on the creation and distribution of in-silico neuron cells. The e-model-packages software collects cells from an in-silico brain circuit and arranges them in individual ‘neuron packages’ to be distributed to the public through the Blue Brain online portals. The cells packages it creates are designed to be easily run with the open source EModelRunner package. The BluePyEModel software creates and optimizes in-silico neurons and is able to reproduce features from real neuronal experiment recordings. Under the hood, it uses the open source BluePyEfe and eFel packages to extract the electrophysiological features from experimental cells, and the open source BluePyOpt simulator to optimize and validate the parameters of the in-silico neurons.","abstract_as_a_tweet":"On the benefits of using workflows: insights from two software tools in the context of computational neuroscience","description":"","duration":"45","python_level":"","domain_level":"","delivery":"in-person","room":"Forum","start":"2022-07-13T12:10:00+01:00","end":"2022-07-13T12:55:00+01:00","talks_in_parallel":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","YYQBM3"],"talks_after":[],"next_talk_code":null,"prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/on-the-benefits-of-using-workflows-insights-from-two-software-tools-in-the-context-of-computational-neuroscience"},{"code":"YYQBM3","title":"Choosing the right database for your next project - Looking at options beyond PostgreSQL and MySQL","speakers":[{"code":"QYTJB9","name":"Marc-Andre Lemburg","biography":"Marc-Andre is the CEO and founder of eGenix.com, a Python-focused project and consulting company based in Germany, specializing in the data, finance and database space. He has a degree in mathematics from the University of Düsseldorf.\r\n\r\nHis work with and for Python started in 1994. He is a Python Core Developer, designed and implemented the Unicode support in Python, and author of the mx Extensions, e.g. mxTools, mxDateTime and mxODBC, which are now distributed and maintained through eGenix.com.\r\n\r\nMarc-Andre is a EuroPython Society (EPS) Fellow, a Python Software Foundation (PSF) founding Fellow and co-founded a local Python meeting in Düsseldorf (PyDDF). He served on the board of the PSF and EPS for many terms and loves to contribute to the growth of Python where ever he can.\r\n\r\nMore information is available on https://malemburg.com/","avatar":"https://program.europython.eu/media/avatars/mal-business-2-170x170_VPXpWrX.jpg","slug":"marc-andre-lemburg","affiliation":"eGenix.com Software, Skills and Service GmbH","homepage":"https://egenix.com/","twitter":"@malemburg"}],"submission_type":"Talk","slug":"choosing-the-right-database-for-your-next-project-looking-at-options-beyond-postgresql-and-mysql","track":"PyData: Data Engineering","state":"confirmed","abstract":"In the last few years, lots of new database engines have been developed, making the selection process even more challenging than it was before, if you want to maintain an edge.\r\n\r\nThe talk will give an overview of what to consider in different situations.","abstract_as_a_tweet":"The database market is thriving these days. Stay on top by learning what's available and which options to consider in your aplication design.","description":"In the last few years, lots of new database engines have been developed and existing ones have been extended to cover new application spaces and features, making the selection process even more challenging than it was before, if you want to maintain an edge.\r\n\r\nThe talk will highlight the most important database engines to consider and their strengths when using them with Python applications, covering relational databases for general purpose tasks, data warehouse workloads, data analytics, machine learning, streaming data and massive scalability, to name a few aspects.\r\n\r\nTalk slides: https://downloads.egenix.com/python/EuroPython-2022-Talk-Choosing-the-right-database-for-your-next-project.pdf","duration":"30","python_level":"some","domain_level":"expert","delivery":"in-person","room":"Liffey Hall 1","start":"2022-07-13T12:10:00+01:00","end":"2022-07-13T12:40:00+01:00","talks_in_parallel":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS"],"talks_after":[],"next_talk_code":null,"prev_talk_code":"KMCFKN","website_url":"https://ep2022.europython.eu/session/choosing-the-right-database-for-your-next-project-looking-at-options-beyond-postgresql-and-mysql"}],"sessionsInParallel":[{"code":"G7MNXY","title":"From pip to poetry - Python (many) ways of packaging and publishing","speakers":[{"code":"PK8LSS","name":"Vinícius Gubiani Ferreira","biography":"Love to code, to read other people's code, and to help others achieve what they want with code. Be it directly or by guiding them to find out for themselves.","avatar":"https://program.europython.eu/media/avatars/profile_xKpnCpq.jpeg","slug":"vinicius-gubiani-ferreira","affiliation":"Azion Technologies","homepage":null,"twitter":null}],"submission_type":"Talk","slug":"from-pip-to-poetry-python-many-ways-of-packaging-and-publishing","track":"Python Libraries","state":"confirmed","abstract":"Ever had issues to manage your python packages and environment? Do you know how to create and share a package to the community? It can be challenging if you've never done it, but it also doesn't have to be hard. There is always a better tool to fit our needs.\r\n\r\nIn this presentation, I'd like to discuss how Python's package managers appeared and evolved with time. Discussing pip, pipenv, and poetry, presenting each of their weak and strong points. Also intend to present how to package and publish a simple code with each one of them, and suggest which package manager should you choose, whether you are just starting with python, or feel like there is something bothering and never knew you could solve it easily and painless.\r\n\r\nSlides can be accessed here:\r\nhttps://github.com/vinigfer/europython_2022_slides","abstract_as_a_tweet":"From pip to poetry - Python (many) ways of packaging and publishing","description":"","duration":"30","python_level":"some","domain_level":"some","delivery":"remote","room":"Liffey B","start":"2022-07-13T11:35:00+01:00","end":"2022-07-13T12:05:00+01:00","talks_in_parallel":["DYDA3H","KMCFKN","MADLNQ","STQEKX","ZYAD7Z"],"talks_after":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"next_talk_code":"9LFFBL","prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/from-pip-to-poetry-python-many-ways-of-packaging-and-publishing"},{"code":"KMCFKN","title":"Data Warehouses Meet Data Lakes","speakers":[{"code":"8MDEKJ","name":"Mauro","biography":"Mauro Pelucchi is a senior data scientist and big data engineer \r\nresponsible for the design of the \"Real-Time Labour Market Information System on Skill Requirements\" for CEDEFOP.\r\n\r\nHe currently works as Head of Global Data Science @ EMSI Burning-Glass with the goal to develop innovative models, methods and deployments of labour market data and other data to meet customer requirements and prototype new potential solutions. His main tasks are related to advanced machine learning modelling, labour market analyses, and the design of big data pipelines to process large datasets of online job vacancies.\r\nIn collaboration with the University of Milano-Bicocca, he took part in many research projects related to the labour market intelligence systems.\r\nHe collaborates with the University of Milano-Bicocca as a lecturer at the Master Business Intelligence and Big Data Analytics and with the University of Bergamo as a lecturer in Computer Engineering.","avatar":"https://program.europython.eu/media/avatars/BGT_Mauro_Pelucchi__LARGE_UV7Pfua.jpg","slug":"mauro","affiliation":"I am the Head of Global Data Science @ EMSI Burning-Glass.","homepage":"www.mauropelucchi.com","twitter":"@mauropelucchi"}],"submission_type":"Talk","slug":"data-warehouses-meet-data-lakes","track":"PyData: Data Engineering","state":"confirmed","abstract":"Many organizations have migrated their data warehouses to datalake solutions in recent years.\r\nWith the convergence of the data warehouse and the data lake, a new data management paradigm has emerged that combines the best of 2 approaches: the botton-up of big data and the top-down of a classic data warehouse.","abstract_as_a_tweet":"Data Warehouses Meet Data Lakes, how build a modern data architecture with python","description":"In this talk, I will explain the current challenges of a datalake and how we can approach a \r\nmoderm data architecture with the help of pyspark, hudi, delta.io or iceberg.\r\nWe will see how organize data in a data lake to support real-time processing of applications \r\nand analyzes across all varieties of data sets, structured and unstructured, how provides \r\nthe scale needed to support enterprise-wide digital transformation and creates one unique source of data \r\nfor multiple audiences.","duration":"30","python_level":"expert","domain_level":"expert","delivery":"in-person","room":"Liffey Hall 1","start":"2022-07-13T11:35:00+01:00","end":"2022-07-13T12:05:00+01:00","talks_in_parallel":["DYDA3H","G7MNXY","MADLNQ","STQEKX","ZYAD7Z"],"talks_after":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"next_talk_code":"YYQBM3","prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/data-warehouses-meet-data-lakes"},{"code":"MADLNQ","title":"Python Packaging Automation — Auto-Publish to PyPI via Pull Requests","speakers":[{"code":"P9YEAF","name":"Justin Mayer","biography":"Justin Mayer is a serial entrepreneur, investor, and advocate for data portability and privacy. His latest project is [Fortressa.com](https://fortressa.com), which replaces expensive SaaS data silos with self-hosted open-source applications. He also maintains the [Pelican static site generator](https://github.com/getpelican/pelican) as well as a number of other projects for Python, Django, and the Fish shell.\r\n\r\nJustin speaks Japanese and Italian, graduated with honors from the University of California, Berkeley, and received his M.B.A. from the Wharton School of Business.\r\n\r\nHe writes about security and privacy at [justinmayer.com](https://justinmayer.com) and via [@JMayer on Twitter](https://twitter.com/jmayer).","avatar":"https://program.europython.eu/media/avatars/jm_c7gpVSI.jpg","slug":"justin-mayer","affiliation":"Fortressa.com","homepage":"https://justinmayer.com","twitter":"@JMayer"}],"submission_type":"Talk","slug":"python-packaging-automation-auto-publish-to-pypi-via-pull-requests","track":"DevOps","state":"confirmed","abstract":"A huge source of friction in software is publishing new releases. Somebody has to manually review commits and write a change-log, add a version number, and publish to PyPI. We will cover a better way: an automated process in which new versions are automatically published by merging pull requests.","abstract_as_a_tweet":"A huge source of friction in software is publishing new releases. Somebody has to review commits, write a change-log, add a version number, and publish to PyPI. There’s a better way: automatically publishing new packages merely by merging pull requests.","description":"Empowering anyone to issue a new release by submitting a pull request? At first glance, it seems like an outlandish idea. Upon further inspection, however, the benefits become clear.\r\n\r\nOne of the biggest sources of friction in software development is packaging and publishing new releases. Somebody has to sift through the commits and write a change-log, tag it with a new version number, and publish the package to PyPI. And usually only one or two people have the access necessary for this last step.\r\n\r\nThe unfortunate result is an infrequent release cadence. Bug fixes and new features are sitting there in the `main` branch, but hardly anybody is benefiting from them because they aren’t in a shipped release yet.\r\n\r\nThankfully, there’s a better way: a continuous release process where new versions are auto-published via pull requests — without any manual monkeying.\r\n\r\nIn this environment, all pull requests must include a release file that describes the changes within. This file must also include whether the new version should be a major, minor, or patch release.\r\n\r\nThe continuous integration (CI) process looks for this file, and if one hasn’t been included, the tests will fail, and the pull request won’t be merged. Otherwise, a maintainer merges the pull request, and the CI process then uses the release file to put the description into the change-log, increment the version number, commit, tag, build, and publish the new release to PyPI.\r\n\r\nSo with almost no human input, every code contribution results in a new release in a matter of minutes. Every feature and bug-fix has its own release, without anyone having to remember to package and publish a new version. Plus, if a bug is found, it’s now much easier to trace it to a specific release version.\r\n\r\nPerhaps the best part is that all contributors get to issue their own releases. What better way to welcome new contributors than to reward them with a dedicated release composed entirely of their own work?\r\n\r\nAttendees of this talk will take home the following knowledge and skills:\r\n\r\n* what kinds of problems are introduced by an infrequent release cadence\r\n* how automated releases solve those problems and provide myriad ancillary benefits\r\n* how to format and parse the release file\r\n* how to use continuous integration (CI) systems to automate releases\r\n* how to add deployment code so new versions are released when PRs are merged\r\n* how to use [AutoPub](https://github.com/autopub/autopub) to facilitate this process","duration":"30","python_level":"none","domain_level":"some","delivery":"in-person","room":"The Auditorium","start":"2022-07-13T11:35:00+01:00","end":"2022-07-13T12:05:00+01:00","talks_in_parallel":["DYDA3H","G7MNXY","KMCFKN","STQEKX","ZYAD7Z"],"talks_after":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"next_talk_code":"E7CX9K","prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/python-packaging-automation-auto-publish-to-pypi-via-pull-requests"},{"code":"STQEKX","title":"Using python to predict Asset price reversals.","speakers":[{"code":"K379P3","name":"Niall O'Connor","biography":"Niall started coding on a sord m5 in 1984, love coding.  Started playing music in 1986, love performing. Started working in a bank in 2012, love trading.  Started gardening in 2017, love gardening.  Started noticing cycles in the markets, similar to the gardening and the seasons.  Started investigating supply chains and trends.  Realized coding and markets and gardening all related.  Discovered harmonic and fibonacci based patterns in the trends, just like music.  Realized my entire life was one gigantic intertwined blob of stuff.  Realized everyone else life is more or less the same.  Chilled out and condensed it all into a 30 minute talk.","avatar":null,"slug":"niall-o-connor","affiliation":"Bank Of America","homepage":"nialloconnor.info","twitter":"@ZechsMarquie"}],"submission_type":"Sponsored Talk","slug":"using-python-to-predict-asset-price-reversals","track":"PyData: Data Engineering","state":"confirmed","abstract":"Using Pandas, Python and Plotly to locate potential trend reversals in Stocks, Crypto or any OHLC feed.  Learn how to locate Fibonacci retrace levels and predict price reversal zones for the lowest risk entry to a trade.","abstract_as_a_tweet":"Using Pandas, Python and Plotly to locate potential trend reversals in Stocks, Crypto or any OHLC feed.","description":"","duration":"30","python_level":"some","domain_level":"none","delivery":"in-person","room":"Wicklow Hall 1","start":"2022-07-13T11:35:00+01:00","end":"2022-07-13T12:05:00+01:00","talks_in_parallel":["DYDA3H","G7MNXY","KMCFKN","MADLNQ","ZYAD7Z"],"talks_after":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"next_talk_code":"8KEVYF","prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/using-python-to-predict-asset-price-reversals"},{"code":"ZYAD7Z","title":"The beginner’s data science project checklist","speakers":[{"code":"XZLFAA","name":"Sara Iris Garcia","biography":"Business Intelligence analyst at NHS and machine learning enthusiast. Sara is active in the Python community and efforts in empowering women in tech by leading and organizing events focused on increasing the visibility of women in stem careers.","avatar":"https://program.europython.eu/media/avatars/20200525_121756_wfAB0TP.jpg","slug":"sara-iris-garcia","affiliation":"NHS","homepage":"https://montjoile.medium.com/","twitter":"@montjoile"}],"submission_type":"Talk","slug":"the-beginners-data-science-project-checklist","track":"PyData: Machine Learning, Stats","state":"confirmed","abstract":"In this talk, I will give you tips and practical advice on what steps to follow and how to plan your data science project to avoid making the most common mistakes during its development.\r\n\r\nDespite my limited experience delivering data science projects, I have learned how to avoid certain mistakes. In this talk I will teach you how to prevent them and save you lots of headaches.","abstract_as_a_tweet":"learn how to avoid the common mistakes when starting a data science project","description":"In this talk you will learn tips on:\r\n\r\n- Defining requirements\r\n- Outlining a data science project\r\n- Reproducibility and Readability checklist\r\n- Best practices for writing Documentation\r\n- Useful python tools\r\n- Tips on presenting your findings\r\n                       \r\nThis is a talk is intended for beginner audience.","duration":"30","python_level":"none","domain_level":"none","delivery":"in-person","room":"Liffey Hall 2","start":"2022-07-13T11:35:00+01:00","end":"2022-07-13T12:05:00+01:00","talks_in_parallel":["DYDA3H","G7MNXY","KMCFKN","MADLNQ","STQEKX"],"talks_after":["8KEVYF","9LFFBL","E7CX9K","N3HJ87","NUF3K9","QQJFSS","YYQBM3"],"next_talk_code":"NUF3K9","prev_talk_code":null,"website_url":"https://ep2022.europython.eu/session/the-beginners-data-science-project-checklist"}]},"__N_SSG":true}